Repository: Microsoft/vs-threading
Catalog: src/Microsoft.VisualStudio.Threading.Analyzers/xlf/Strings.*.xlf
Languages: es, fr, pl, tr

# AwaitXInstead
source: Await {0} instead
es: Use await {0} en su lugar
fr: Attendre {0} à la place
pl: Zamiast tego oczekuj na {0}
tr: Bunun yerine: Await {0}

# SystemIAsyncDisposablePackageNote
source: The System.IAsyncDisposable interface is defined in the Microsoft.Bcl.AsyncInterfaces NuGet package.
es: La interfaz System.IAsyncDisposable se define en el paquete NuGet Microsoft.Bcl.AsyncInterfaces.
fr: L'interface System.IAsyncDisposable est définie dans le package NuGet Microsoft.Bcl.AsyncInterfaces.
pl: Interfejs System.IAsyncDisposable jest zdefiniowany w pakiecie NuGet Microsoft.Bcl.AsyncInterfaces.
tr: System.IAsyncDisposable arabirimi Microsoft.Bcl.AsyncInterfaces NuGet paketinde tanımlanmıştır.

source: Use await instead
es: Use await en su lugar
fr: Utiliser await à la place
pl: Zamiast tego używaj oczekiwania
tr: Bunun yerine await kullanın

# VSTHRD001_MessageFormat
source: Await JoinableTaskFactory.SwitchToMainThreadAsync() to switch to the UI thread instead of APIs that can deadlock or require specifying a priority.
es: Use el método await JoinableTaskFactory.SwitchToMainThreadAsync() para cambiar al subproceso de interfaz de usuario en lugar de a API que pueden causar interbloqueo o requerir que se especifique una prioridad.
fr: Attendez que JoinableTaskFactory.SwitchToMainThreadAsync() passe au thread d'interface utilisateur au lieu des API susceptibles de se bloquer ou de demander une priorité.
pl: Zaczekaj, aż metoda JoinableTaskFactory.SwitchToMainThreadAsync() przełączy się do wątku interfejsu użytkownika zamiast interfejsów API, które mogą ulec zakleszczeniu lub wymagać określenia priorytetu.
tr: Kilitlenebilen ya da öncelik belirtilmesini gerektiren API’ler yerine JoinableTaskFactory.SwitchToMainThreadAsync() öğesinin UI iş parçacığına geçmesini bekleyin.

# VSTHRD001_Title
source: Avoid legacy thread switching APIs
es: Evite cambiar a API de subprocesos heredados
fr: Éviter les API de commutation de thread héritées
pl: Unikaj starszych interfejsów API przełączających wątki
tr: İş parçacıkları arasında geçiş yapan eski API’lerden kaçının

# VSTHRD002_CodeFix_Await_Title
source: Use await instead
es: Use await en su lugar
fr: Utiliser await à la place
pl: Zamiast tego używaj oczekiwania
tr: Bunun yerine await kullanın

# VSTHRD002_MessageFormat
source: Synchronously waiting on tasks or awaiters may cause deadlocks. Use await or JoinableTaskFactory.Run instead.
es: La espera sincrónica de tareas o elementos que ejecutan await puede provocar interbloqueos. Use await o JoinableTaskFactory.Run en su lugar.
fr: L'attente de manière synchrone de tâches ou d’éléments en attente peut entraîner des blocages. Utilisez await ou JoinableTaskFactory.Run à la place.
pl: Synchroniczne oczekiwanie na zadania lub elementy typu awaiter mogą powodować zakleszczenia. Zamiast tego używaj metody await lub JoinableTaskFactory.Run.
tr: Görevlerde veya bekleyen öğelerde zaman uyumlu olarak beklemek kilitlenmelere neden olabilir. Bunun yerine bekleyen veya JoinableTaskFactory.Run kullanın.

# VSTHRD002_Title
source: Avoid problematic synchronous waits
es: Evite esperas sincrónicas problemáticas
fr: Éviter les attentes synchrones problématiques
pl: Unikaj problematycznych oczekiwań synchronicznych
tr: Sorunlu zaman uyumlu beklemelerden kaçının

# VSTHRD003_MessageFormat
source: Avoid awaiting or returning a Task representing work that was not started within your context as that can lead to deadlocks. Start the work within this context, or use JoinableTaskFactory.RunAsync to start the task and await the returned JoinableTask instead.
es: Evita la espera o la devolución de una tarea que representa el trabajo no iniciado en su contexto, ya que puede dar lugar a bloqueos. Inicie el trabajo en este contexto o use JoinableTaskFactory.RunAsync para iniciar la tarea y esperar en su lugar el objeto JoinableTask devuelto.
fr: Évitez d'attendre ou de retourner une tâche représentant un travail non démarré dans votre contexte, car cela peut provoquer des interblocages. Démarrez le travail dans ce contexte, ou utilisez JoinableTaskFactory.RunAsync pour commencer la tâche, et attendez plutôt le JoinableTask retourné.
pl: Unikaj oczekiwania na obiekt Task lub zwracania obiektu Task reprezentującego pracę, która nie została uruchomiona w danym kontekście, ponieważ może to prowadzić do zakleszczeń. Uruchom pracę w tym kontekście lub zamiast tego użyj metody JoinableTaskFactory.RunAsync w celu uruchomienia zadania i oczekuj na zwrócony obiekt JoinableTask.
tr: Çıkmazlara yol açabileceğinden, bağlamınızda başlatılmamış işi temsil eden bir Görevi beklemekten veya döndürmekten kaçının. İşi bu bağlamda başlatın veya bunun yerine görevi başlatmak için JoinableTaskFactory.RunAsync kullanıp döndürülen JoinableTask öğesini bekleyin.

# VSTHRD003_Title
source: Avoid awaiting foreign Tasks
es: Evitar la espera de tareas externas
fr: Éviter d'attendre des tâches étrangères
pl: Unikaj oczekiwania na obce obiekty Task
tr: Yabancı Görevleri beklemekten kaçının

# VSTHRD004_MessageFormat
source: Calls to JoinableTaskFactory.SwitchToMainThreadAsync() must be awaited.
es: Se deben esperar las llamadas a JoinableTaskFactory.SwitchToMainThreadAsync().
fr: Vous devez attendre les appels à JoinableTaskFactory.SwitchToMainThreadAsync().
pl: Należy zaczekać na wywołania metody JoinableTaskFactory.SwitchToMainThreadAsync().
tr: JoinableTaskFactory.SwitchToMainThreadAsync() çağrıları beklenmelidir.

# VSTHRD004_Title
source: Await SwitchToMainThreadAsync
es: Esperar a SwitchToMainThreadAsync
fr: Attendre SwitchToMainThreadAsync
pl: Zaczekaj na metodę SwitchToMainThreadAsync
tr: SwitchToMainThreadAsync bekleyin

# VSTHRD010_MessageFormat_Async
source: Accessing "{0}" should only be done on the main thread. Await JoinableTaskFactory.SwitchToMainThreadAsync() first.
es: El acceso a "{0}" solo se debe realizar en el subproceso principal. Espere primero a JoinableTaskFactory.SwitchToMainThreadAsync().
fr: L'accès à "{0}" doit être uniquement effectué sur le thread principal. Attendez d'abord JoinableTaskFactory.SwitchToMainThreadAsync().
pl: Dostęp do metody „{0}” powinien być uzyskiwany tylko z wątku głównego. Najpierw zaczekaj na metodę JoinableTaskFactory.SwitchToMainThreadAsync().
tr: "{0}" erişimi yalnızca ana iş parçacığı üzerinde gerçekleştirilmelidir. Önce JoinableTaskFactory.SwitchToMainThreadAsync() metodunu bekleyin.

# VSTHRD010_MessageFormat_Sync
source: Accessing "{0}" should only be done on the main thread. Call {1}() first.
es: El acceso a "{0}" solo se debe realizar en el subproceso principal. Llame primero a {1}().
fr: L'accès à "{0}" doit être uniquement effectué sur le thread principal. Appelez d'abord {1}().
pl: Dostęp do metody „{0}” powinien być uzyskiwany tylko z wątku głównego. Najpierw wywołaj metodę {1}().
tr: "{0}" erişimi yalnızca ana iş parçacığı üzerinde gerçekleştirilmelidir. Önce {1}() çağırın.

# VSTHRD010_Title
source: Invoke single-threaded types on Main thread
es: Invocar tipos uniproceso en el subproceso principal
fr: Appeler les types à thread unique sur le thread principal
pl: Wywołuj typy jednowątkowe w wątku głównym
tr: Ana iş parçacığındaki tek iş parçacıklı türleri çağırın

# VSTHRD011_MessageFormat
source: Lazy<Task<T>>.Value can deadlock. Use AsyncLazy<T> instead.
es: Lazy<Task<T>>. Posible interbloqueo del valor. Use AsyncLazy<T> en su lugar.
fr: Lazy<Task<T>>.Value peut entraîner un interblocage. Utilisez AsyncLazy<T> à la place.
pl: Element Lazy<Task<T>>.Value może ulec zakleszczeniu. Zamiast tego używaj klasy AsyncLazy<T>.
tr: Lazy<Task<T>>.Değer kilitlenebilir. Bunun yerine AsyncLazy<T> kullanın.

# VSTHRD011_Title
source: Use AsyncLazy<T>
es: Usar AsyncLazy<T>
fr: Utiliser AsyncLazy<T>
pl: Użyj klasy AsyncLazy<T>
tr: AsyncLazy kullanın<T>

# VSTHRD011b_MessageFormat
source: Invoking or blocking on async code in a Lazy<T> value factory can deadlock. Use AsyncLazy<T> instead.
es: La invocación o el bloqueo del código asincrónico en un valor Lazy<T> predeterminado de fábrica puede generar un interbloqueo. Use AsyncLazy<T> en su lugar.
fr: L'appel ou le blocage de code asynchrone dans une fabrique de valeurs Lazy<T> peut entraîner un interblocage. Utilisez AsyncLazy<T> à la place.
pl: Wywołanie kodu asynchronicznego lub zablokowanie na nim w fabryce wartości Lazy<T> może spowodować zakleszczenie. Zamiast tego użyj elementu AsyncLazy<T>.
tr: Bir Lazy<T> değer fabrikasındaki asenkron kod üzerinde çağrı veya engelleme yapma çıkmaza neden olabilir. Bunun yerine AsyncLazy<T> kullanın.

# VSTHRD012_MessageFormat
source: Provide an instance of JoinableTaskFactory in this call (or another overload) to avoid deadlocks with the main thread.
es: Proporcione una instancia de JoinableTaskFactory en esta llamada (u otra sobrecarga) para evitar interbloqueos con el subproceso principal.
fr: Fournissez une instance de JoinableTaskFactory dans cet appel (ou une autre surcharge) pour éviter les blocages avec le même thread.
pl: Podaj wystąpienie elementu JoinableTaskFactory w tym wywołaniu (albo innym przeciążeniu), aby uniknąć zakleszczeń w wątku głównym.
tr: Ana iş parçacığında kilitlenmeleri önlemek için bu çağrıda (veya başka bir aşırı yüklemede) bir JoinableTaskFactory örneği sağlayın.

# VSTHRD012_Title
source: Provide JoinableTaskFactory where allowed
es: Proporcione JoinableTaskFactory donde se permita
fr: Fournir JoinableTaskFactory quand autorisé
pl: Podaj element JoinableTaskFactory w miejscach, gdzie jest to dopuszczalne
tr: İzin veriliyorsa JoinableTaskFactory sağlayın

# VSTHRD100_CodeFix_Title
source: Change return type to Task
es: Cambie el tipo de valor devuelto a Task
fr: Remplacer le type de retour par Task
pl: Zmień zwracany typ na Task
tr: Döndürme türünü Task olarak değiştirin

# VSTHRD100_MessageFormat
source: Avoid "async void" methods, because any exceptions not handled by the method will crash the process.
es: Evite métodos "async void", porque las excepciones no controladas por el método bloquearán el proceso.
fr: Évitez les méthodes "async void", car toute exception non traitée par la méthode bloque le processus.
pl: Unikaj metod „async void”, ponieważ wszelkie wyjątki, które nie zostaną przez nie obsłużone, spowodują awarię procesu.
tr: "async void" metotları tarafından işlenmeyen tüm özel durumlar işlemi kilitleyeceğinden bunları kullanmayın.

# VSTHRD100_Title
source: Avoid async void methods
es: Evite métodos async void
fr: Éviter les méthodes async void
pl: Unikaj metod „async void”
tr: Async void metotları kullanmayın

# VSTHRD101_MessageFormat
source: Avoid using async lambda for a void returning delegate type, because any exceptions not handled by the delegate will crash the process.
es: Evite usar la lambda async para un tipo de delegado de devolución void, porque las excepciones no controladas por el delegado bloquearán el proceso.
fr: Évitez d’utiliser une expression lambda asynchrone pour un type de délégué retournant void, car toute exception non traitée par la méthode bloque le processus.
pl: Unikaj używania asynchronicznego wyrażenia lambda dla typu delegata zwracającego „void”, ponieważ wszelkie wyjątki, które nie zostaną obsłużone przez delegata, spowodują awarię procesu.
tr: Temsilci tarafından işlenmeyen tüm özel durumlar işlemi kilitleyeceğinden, temsilci türü döndüren bir void için async lambda kullanmayın.

# VSTHRD101_Title
source: Avoid unsupported async delegates
es: Evite delegados asincrónicos no compatibles
fr: Éviter les délégués async non pris en charge
pl: Unikaj nieobsługiwanych delegatów asynchronicznych
tr: Desteklenmeyen async temsilcilerini kullanmayın

# VSTHRD102_MessageFormat
source: Limit use of synchronously blocking method calls such as JoinableTaskFactory.Run or Task.Result to public entrypoint members where you must be synchronous. Using it for internal members can needlessly add synchronous frames between asynchronous frames, leading to threadpool exhaustion.
es: Limite el uso de llamadas de métodos de bloqueo sincrónico, como JoinableTaskFactory.Run o Task.Result, a miembros de punto de entrada públicos donde tiene que ser sincrónico. El uso para miembros internos puede agregar innecesariamente marcos sincrónicos entre marcos asincrónicos, provocando el agotamiento del conjunto de subprocesos.
fr: Limitez l'utilisation des appels de méthode de blocage synchrones, comme JoinableTaskFactory.Run ou Task.Result, aux membres de point d’entrée publics où il est nécessaire d’être synchrone. Son utilisation pour des membres internes peut inutilement ajouter des frames synchrones entre les frames asynchrones, provoquant l'épuisement du pool de threads.
pl: Ogranicz stosowanie wywołań metod z blokowaniem synchronicznym, takich jak JoinableTaskFactory.Run lub Task.Result, do publicznych elementów członkowskich punktów wyjścia, w przypadku których konieczne jest działanie synchroniczne. Stosowanie tego rozwiązania w przypadku wewnętrznych elementów członkowskich może powodować niepotrzebne dodawanie ramek synchronicznych między ramkami asynchronicznymi, co może prowadzić do wyczerpania puli wątków.
tr: Zaman uyumlu olmanız gereken genel giriş noktası üyelerinde, JoinableTaskFactory.Run veya Task.Result gibi zaman uyumlu olarak engelleyen metot çağrılarının kullanımını sınırlayın. Bunu iç üyeler için kullanmak, zaman uyumsuz çerçevelerin arasına gereksiz yere zaman uyumlu çerçeveler ekleyerek iş parçacığı havuzunun tükenmesine sebep olabilir.

# VSTHRD102_Title
source: Implement internal logic asynchronously
es: Implemente la lógica interna asincrónicamente
fr: Implémenter la logique interne de façon asynchrone
pl: Logikę wewnętrzną implementuj asynchronicznie
tr: İç mantığı zaman uyumsuz olarak uygulayın

# VSTHRD103_MessageFormat
source: {0} synchronously blocks. Await {1} instead.
es: {0} bloquea sincrónicamente. Use await {1} en su lugar.
fr: {0} bloque de façon synchrone. Attendez {1} à la place.
pl: Metoda {0} powoduje blokowanie synchroniczne. Zamiast tego oczekuj na {1}.
tr: {0} zaman uyumlu olarak engeller. Bunun yerine {1} bekleyin.

# VSTHRD103_MessageFormat_UseAwaitInstead
source: {0} synchronously blocks. Use await instead.
es: {0} bloquea sincrónicamente. Use await en su lugar.
fr: {0} bloque de façon synchrone. Utilisez await à la place
pl: Metoda {0} powoduje blokowanie synchroniczne. Zamiast tego używaj oczekiwania.
tr: {0} zaman uyumlu olarak engeller. Bunun yerine await kullanın.

# VSTHRD103_Title
source: Call async methods when in an async method
es: Llame a métodos asincrónicos cuando esté en un método asincrónico
fr: Appeler des méthodes async dans une méthode async
pl: W metodach asynchronicznych wywołuj metody asynchroniczne
tr: Zaman uyumsuz metottayken zaman uyumsuz metotlar çağırın

# VSTHRD104_MessageFormat
source: Expose an async version of this method that does not synchronously block. Then simplify this method to call that async method within a JoinableTaskFactory.Run delegate.
es: Exponga una versión asincrónica de este método que no cause bloqueo de manera sincrónica. A continuación, simplifique este método para llamar a ese método asincrónico dentro de un delegado JoinableTaskFactory.Run.
fr: Exposez une version asynchrone de cette méthode qui ne se bloque pas de manière synchrone. Ensuite, simplifiez cette méthode pour appeler cette méthode async dans un délégué JoinableTaskFactory.Run.
pl: Uwidocznij asynchroniczną wersję tej metody, która nie powoduje synchronicznego blokowania. Następnie uprość tę metodę, aby wywołać tę metodę asynchroniczną w ramach delegata JoinableTaskFactory.Run.
tr: Bu metodun zaman uyumlu olarak engellemeyen zaman uyumsuz bir sürümünü sunun. Sonra bir JoinableTaskFactory.Run temsilcisi içinde bu zaman uyumsuz metoda çağrı yapmak için bu metodu basitleştirin.

# VSTHRD104_Title
source: Offer async methods
es: Ofrezca métodos asincrónicos
fr: Offrir des méthodes async
pl: Oferuj metody asynchroniczne
tr: Zaman uyumsuz metotlar sunun

# VSTHRD105_MessageFormat
source: Avoid method overloads that assume TaskScheduler.Current. Use an overload that accepts a TaskScheduler and specify TaskScheduler.Default (or any other) explicitly.
es: Evite las sobrecargas de métodos que asumen TaskScheduler.Current. Use una sobrecarga que acepte un elemento TaskScheduler y especifique TaskScheduler.Default (o cualquier otro) explícitamente.
fr: Évitez les surcharges de méthode qui optent par défaut pour TaskScheduler.Current. Utilisez une surcharge qui accepte un TaskScheduler et spécifiez TaskScheduler.Default (ou autre chose) de manière explicite.
pl: Unikaj przeciążeń metod zakładających korzystanie z właściwości TaskScheduler.Current. Używaj przeciążenia przyjmującego obiekt TaskScheduler i jawnie określaj właściwość TaskScheduler.Default (lub inną).
tr: TaskScheduler.Current varsayan metot aşırı yüklemelerinden kaçının. TaskScheduler kabul eden bir aşırı yükleme kullanın ve TaskScheduler.Default (veya başka birini) açık olarak belirtin.

# VSTHRD105_Title
source: Avoid method overloads that assume TaskScheduler.Current
es: Evite las sobrecargas de métodos que asumen TaskScheduler.Current
fr: Éviter les surcharges de méthode qui optent par défaut pour TaskScheduler.Current
pl: Unikaj przeciążeń metod zakładających korzystanie z właściwości TaskScheduler.Current
tr: TaskScheduler.Current varsayan metot aşırı yüklemelerinden kaçının

# VSTHRD106_MessageFormat
source: AsyncEventHandler delegates should be invoked via the extension method "TplExtensions.InvokeAsync()" defined in Microsoft.VisualStudio.Threading assembly.
es: Los delegados de AsyncEventHandler deben invocarse a través del método de extensión "TplExtensions.InvokeAsync()" definido en el ensamblado Microsoft.VisualStudio.Threading.
fr: Les délégués AsyncEventHandler doivent être appelés avec la méthode d’extension "TplExtensions.InvokeAsync()" définie dans l’assembly Microsoft.VisualStudio.Threading.
pl: Delegatów AsyncEventHandler powinno się wywoływać za pośrednictwem metody rozszerzenia „TplExtensions.InvokeAsync()” zdefiniowanej w zestawie Microsoft.VisualStudio.Threading.
tr: AsyncEventHandler temsilcileri, Microsoft.VisualStudio.Threading bütünleştirilmiş kodunda tanımlanan "TplExtensions.InvokeAsync()" genişletme metodu aracılığıyla çağrılmalıdır.

# VSTHRD106_Title
source: Use InvokeAsync to raise async events
es: Use InvokeAsync para desencadenar eventos asincrónicos
fr: Utiliser InvokeAsync pour déclencher des événements async
pl: Zdarzenia asynchroniczne wywołuj za pomocą metody InvokeAsync
tr: Async olayları tetiklemek için InvokeAsync kullanın

# VSTHRD107_CodeFix_Title
source: Await using expression
es: Usar await en expresión using
fr: Attendre l’expression using
pl: Oczekuj w wyrażeniu using
tr: Await using ifadesi

# VSTHRD107_MessageFormat
source: Missing await operator for "using" expression.
es: Falta el operador await en la expresión "using".
fr: Opérateur await manquant pour l’expression "using".
pl: Brak operatora await dla wyrażenia „using”.
tr: “using” ifadesi için await işleci eksik.

# VSTHRD107_Title
source: Await Task within using expression
es: Usar await para tarea dentro de expresión using
fr: Tâche Await dans l’expression using
pl: Oczekuj na zadanie wewnątrz wyrażenia using
tr: using ifadesi içinde await Task

# VSTHRD108_MessageFormat
source: Thread affinity checks should be unconditional.
es: Las comprobaciones de afinidad de subproceso deben ser incondicionales.
fr: Les vérifications d'affinité de thread doivent être inconditionnelles.
pl: Testy koligacji wątku powinny być bezwarunkowe.
tr: İş parçacığı benzeşim denetimleri koşulsuz olmalıdır.

# VSTHRD108_Title
source: Assert thread affinity unconditionally
es: Declarar afinidad de subproceso incondicionalmente
fr: Effectuer l'assertion de l'affinité de thread de manière inconditionnelle
pl: Bezwarunkowo potwierdź koligację wątku
tr: İş parçacığı benzeşimini koşulsuz olarak onayla

# VSTHRD109_MessageFormat
source: Avoid throwing when not on the main thread while in an async or Task-returning method. Switch to the thread required instead.
es: Evite lanzar cuando no esté en el subproceso principal durante un método asincrónico o que devuelve tareas. Cambie en su lugar al subproceso requerido.
fr: Évitez toute levée quand vous n'êtes pas sur the thread principal dans une méthode retournant async ou Task. Basculez plutôt sur le thread requis.
pl: Unikaj zgłaszania poza wątkiem głównym w metodzie asynchronicznej lub zwracającej element Task. Zamiast tego przełącz się na wymagany wątek.
tr: Ana iş parçacığında değilken, zaman uyumsuz veya Task döndüren metot içinden özel durum oluşturmaktan kaçının. Bunun yerine, gereken iş parçacığına geçin.

# VSTHRD109_Title
source: Switch instead of assert in async methods
es: Cambiar en lugar de declarar en métodos asincrónicos
fr: Basculer sur des méthodes async plutôt qu'assert
pl: Przełączanie zamiast asercji w metodach asynchronicznych
tr: Zaman uyumsuz metotlarda assert yerine switch

# VSTHRD110_MessageFormat
source: Observe the awaitable result of this method call by awaiting it, assigning to a variable, or passing it to another method.
es: Observe el resultado que se puede esperar de esta llamada a método cuando se espera, se asigna a una variable o se pasa a otro método.
fr: Observez le résultat pouvant être attendu de cet appel de méthode en l'attendant, en l'assignant à une variable ou en le passant à une autre méthode.
pl: Obserwuj wynik typu awaitable wywołania tej metody, oczekując na niego, przypisując go do zmiennej lub przekazując do innej metody.
tr: Bu metot çağrısının beklenebilir sonucunu bekleyerek, bir değişkene atayarak veya bir başka metoda geçirerek gözlemleyin.

# VSTHRD110_Title
source: Observe result of async calls
es: Observar resultado de llamadas asincrónicas
fr: Observer le résultat des appels async
pl: Obserwuj wynik wywołań asynchronicznych
tr: Zaman uyumsuz çağrıların sonucunu gözlemleyin

# VSTHRD111_CodeFix_False_Title
source: Add .ConfigureAwait(false)
es: Agregar .ConfigureAwait(false)
fr: Ajouter .ConfigureAwait(false)
pl: Dodaj ciąg .ConfigureAwait(false)
tr: .ConfigureAwait(false) ekleyin

# VSTHRD111_CodeFix_True_Title
source: Add .ConfigureAwait(true)
es: Agregar .ConfigureAwait(true)
fr: Ajouter .ConfigureAwait(true)
pl: Dodaj ciąg .ConfigureAwait(true)
tr: .ConfigureAwait(true) ekleyin

# VSTHRD111_MessageFormat
source: Add .ConfigureAwait(bool) to your await expression.
es: Agregue .ConfigureAwait(bool) a su expresión await.
fr: Ajoutez .ConfigureAwait(bool) à votre expression await.
pl: Dodaj ciąg.ConfigureAwait(bool) do swojego wyrażenia await.
tr: await ifadenize .ConfigureAwait(bool) ekleyin.

# VSTHRD111_Title
source: Use ConfigureAwait(bool)
es: Usar ConfigureAwait(bool)
fr: Utiliser ConfigureAwait(bool)
pl: Użyj metody ConfigureAwait(bool)
tr: ConfigureAwait(bool) kullanın

# VSTHRD112_CodeFix_Title
source: Add implementation of System.IAsyncDisposable.
es: Agregue la implementación de System.IAsyncDisposable.
fr: Ajoutez l'implémentation de System.IAsyncDisposable.
pl: Dodaj implementację interfejsu System.IAsyncDisposable.
tr: System.IAsyncDisposable uygulamasını ekleyin.
