Repository: microsoft/vs-threading
Catalog: src/Microsoft.VisualStudio.Threading.Analyzers/xlf/Strings.*.xlf
Languages: cs

# AwaitXInstead
source: Await {0} instead
cs: Použijte raději await {0}.

source: Use await instead
cs: Použijte raději await.

# VSTHRD001_MessageFormat
source: Await JoinableTaskFactory.SwitchToMainThreadAsync() to switch to the UI thread instead of APIs that can deadlock or require specifying a priority.
cs: Počkejte, než se na vlákno uživatelského rozhraní přepne JoinableTaskFactory.SwitchToMainThreadAsync(), a ne rozhraní API, která se můžou zablokovat nebo vyžadovat zadání priority.

# VSTHRD001_Title
source: Avoid legacy thread switching APIs
cs: Vyhněte se starším verzím rozhraní API pro přepínání vláken

# VSTHRD002_CodeFix_Await_Title
source: Use await instead
cs: Použijte raději await.

# VSTHRD002_MessageFormat
source: Synchronously waiting on tasks or awaiters may cause deadlocks. Use await or JoinableTaskFactory.Run instead.
cs: Synchronní čekání na položky typu task nebo awaiter může způsobit vzájemné zablokování. Místo toho použijte await nebo JoinableTaskFactory.Run.

# VSTHRD002_Title
source: Avoid problematic synchronous waits
cs: Vyhněte se problematickým synchronním čekáním

# VSTHRD003_MessageFormat
source: Avoid awaiting or returning a Task representing work that was not started within your context as that can lead to deadlocks. Start the work within this context, or use JoinableTaskFactory.RunAsync to start the task and await the returned JoinableTask instead.
cs: Vyhněte se čekání na úlohu (nebo vracení úlohy) představující práci, která nebyla zahájena ve vašem kontextu, protože to může vést k zablokování. Zahajte danou práci v tomto kontextu, nebo místo toho spusťte úlohu pomocí JoinableTaskFactory.RunAsync a očekávejte vrácenou hodnotu JoinableTask.

# VSTHRD003_Title
source: Avoid awaiting foreign Tasks
cs: Vyhněte se čekání na cizí úlohy.

# VSTHRD004_MessageFormat
source: Calls to JoinableTaskFactory.SwitchToMainThreadAsync() must be awaited.
cs: U volání JoinableTaskFactory.SwitchToMainThreadAsync() se musí čekat na dokončení.

# VSTHRD004_Title
source: Await SwitchToMainThreadAsync
cs: Použijte Await SwitchToMainThreadAsync

# VSTHRD010_MessageFormat_Async
source: Accessing "{0}" should only be done on the main thread. Await JoinableTaskFactory.SwitchToMainThreadAsync() first.
cs: Přístup k {0} by se měl provádět jenom v hlavním vláknu. Napřed počkejte na dokončení volání metody JoinableTaskFactory.SwitchToMainThreadAsync().

# VSTHRD010_MessageFormat_Sync
source: Accessing "{0}" should only be done on the main thread. Call {1}() first.
cs: Přístup k {0} by se měl provádět jenom v hlavním vláknu. Napřed volejte {1}().

# VSTHRD010_Title
source: Invoke single-threaded types on Main thread
cs: Vyvolání typů s jedním vláknem z hlavního vlákna

# VSTHRD011_MessageFormat
source: Lazy<Task<T>>.Value can deadlock. Use AsyncLazy<T> instead.
cs: Lazy<Task<T>>.Value může způsobit zablokování. Použijte místo toho AsyncLazy<T>.

# VSTHRD011_Title
source: Use AsyncLazy<T>
cs: Použít AsyncLazy<T>

# VSTHRD011b_MessageFormat
source: Invoking or blocking on async code in a Lazy<T> value factory can deadlock. Use AsyncLazy<T> instead.
cs: Volání nebo blokování asynchronního kódu v objektu pro vytváření hodnot Lazy<T> může způsobit zablokování. Použijte místo toho AsyncLazy<T>.

# VSTHRD012_MessageFormat
source: Provide an instance of JoinableTaskFactory in this call (or another overload) to avoid deadlocks with the main thread.
cs: Zadejte instanci JoinableTaskFactory v tomto volání (nebo v jiném přetížení), aby se předešlo zablokováním s hlavním vláknem.

# VSTHRD012_Title
source: Provide JoinableTaskFactory where allowed
cs: Zadejte JoinableTaskFactory, kde je to povoleno

# VSTHRD100_CodeFix_Title
source: Change return type to Task
cs: Změňte návratový typ na Task.

# VSTHRD100_MessageFormat
source: Avoid "async void" methods, because any exceptions not handled by the method will crash the process.
cs: Nepoužívejte metody async void, protože veškeré výjimky neošetřené metodou způsobí selhání procesu.

# VSTHRD100_Title
source: Avoid async void methods
cs: Vyhněte se použití metod async void

# VSTHRD101_MessageFormat
source: Avoid using async lambda for a void returning delegate type, because any exceptions not handled by the delegate will crash the process.
cs: U typu delegáta, který vrací hodnotu void, se vyhněte použití asynchronního výrazu lambda, protože veškeré výjimky neošetřené delegátem způsobí selhání procesu.

# VSTHRD101_Title
source: Avoid unsupported async delegates
cs: Vyhněte se použití nepodporovaných asynchronních delegátů

# VSTHRD102_MessageFormat
source: Limit use of synchronously blocking method calls such as JoinableTaskFactory.Run or Task.Result to public entrypoint members where you must be synchronous. Using it for internal members can needlessly add synchronous frames between asynchronous frames, leading to threadpool exhaustion.
cs: Omezte použití volání metod, které provádí synchronní blokování, například JoinableTaskFactory.Run nebo Task.Result, na veřejné členy vstupního bodu, kde musíte být synchronní. Použití těchto metod pro interní členy zbytečně přidává synchronní rámce mezi asynchronní rámce, což vede k vyčerpání fondu vláken.

# VSTHRD102_Title
source: Implement internal logic asynchronously
cs: Asynchronní implementace interní logiky

# VSTHRD103_MessageFormat
source: {0} synchronously blocks. Await {1} instead.
cs: {0} provádí synchronní blokování. Místo toho použijte await {1}.

# VSTHRD103_MessageFormat_UseAwaitInstead
source: {0} synchronously blocks. Use await instead.
cs: {0} provádí synchronní blokování. Místo toho použijte await.

# VSTHRD103_Title
source: Call async methods when in an async method
cs: Volání asynchronních metod v asynchronní metodě

# VSTHRD104_MessageFormat
source: Expose an async version of this method that does not synchronously block. Then simplify this method to call that async method within a JoinableTaskFactory.Run delegate.
cs: Vystavte asynchronní verzi této metody, která neprovádí synchronní blokování. Potom tuto metodu zjednodušte tak, aby volala danou asynchronní metodu v rámci delegáta JoinableTaskFactory.Run.

# VSTHRD104_Title
source: Offer async methods
cs: Nabízejte asynchronní metody

# VSTHRD105_MessageFormat
source: Avoid method overloads that assume TaskScheduler.Current. Use an overload that accepts a TaskScheduler and specify TaskScheduler.Default (or any other) explicitly.
cs: Nepoužívejte přetížení metod, která předpokládají TaskScheduler.Current. Použijte přetížení, které akceptuje TaskScheduler a explicitně zadejte TaskScheduler.Default (případně jakoukoli jinou vlastnost).

# VSTHRD105_Title
source: Avoid method overloads that assume TaskScheduler.Current
cs: Vyhněte se přetížením metod, která předpokládají TaskScheduler.Current

# VSTHRD106_MessageFormat
source: AsyncEventHandler delegates should be invoked via the extension method "TplExtensions.InvokeAsync()" defined in Microsoft.VisualStudio.Threading assembly.
cs: Delegáti AsyncEventHandler se musí volat prostřednictvím metody rozšíření TplExtensions.InvokeAsync() definované v sestavení Microsoft.VisualStudio.Threading.

# VSTHRD106_Title
source: Use InvokeAsync to raise async events
cs: Použití InvokeAsync k vyvolání asynchronních událostí

# VSTHRD107_CodeFix_Title
source: Await using expression
cs: Výraz using s operátorem await

# VSTHRD107_MessageFormat
source: Missing await operator for "using" expression.
cs: Chybí operátor await ve výrazu using.

# VSTHRD107_Title
source: Await Task within using expression
cs: Úloha await ve výrazu using

# VSTHRD108_MessageFormat
source: Thread affinity checks should be unconditional.
cs: Kontroly spřažení vláken by měly být bez podmínek.

# VSTHRD108_Title
source: Assert thread affinity unconditionally
cs: Vyhodnotit spřažení vláken bez podmínek

# VSTHRD109_MessageFormat
source: Avoid throwing when not on the main thread while in an async or Task-returning method. Switch to the thread required instead.
cs: Vyhněte se tomuto volání, pokud nejste v hlavním vláknu a jste v asynchronní metodě nebo metodě, která vrací Task. Místo toho přepněte na požadované vlákno.

# VSTHRD109_Title
source: Switch instead of assert in async methods
cs: V asynchronních metodách použijte Switch místo Assert

# VSTHRD110_MessageFormat
source: Observe the awaitable result of this method call by awaiting it, assigning to a variable, or passing it to another method.
cs: Přijměte očekávatelný výsledek volání této metody tak, že na něj počkáte, přiřadíte ho do proměnné nebo ho předáte další metodě.

# VSTHRD110_Title
source: Observe result of async calls
cs: Přijměte výsledek asynchronních volání

# VSTHRD111_CodeFix_False_Title
source: Add .ConfigureAwait(false)
cs: Přidat .ConfigureAwait(false)

# VSTHRD111_CodeFix_True_Title
source: Add .ConfigureAwait(true)
cs: Přidat .ConfigureAwait(true)

# VSTHRD111_MessageFormat
source: Add .ConfigureAwait(bool) to your await expression.
cs: Přidejte .ConfigureAwait(bool) ke svému výrazu await.

# VSTHRD111_Title
source: Use ConfigureAwait(bool)
cs: Používat ConfigureAwait(bool)

# VSTHRD200_AddAsync_MessageFormat
source: Use "Async" suffix in names of methods that return an awaitable type.
cs: V názvech metod, které vrací typ awaitable, používejte příponu „Async“.

# VSTHRD200_CodeFix_Title
source: Rename to {0}
cs: Přejmenování na {0}

# VSTHRD200_RemoveAsync_MessageFormat
source: Avoid "Async" suffix in names of methods that do not return an awaitable type.
cs: V názvech metod, které nevrací typ awaitable, se vyhněte používání přípony „Async“.

# VSTHRD200_Title
source: Use "Async" suffix for async methods
cs: Použití přípony Async pro asynchronní metody

# VSTHRD201_CodeFix_Title
source: Call ThrowIfCancellationRequested()
cs: Volat metodu ThrowIfCancellationRequested()

# VSTHRD201_MessageFormat
source: Check for cancellation after calling SwitchToMainThreadAsync(CancellationToken).
cs: Po volání metody SwitchToMainThreadAsync(CancellationToken) zkontrolujte zrušení.

# VSTHRD201_Title
source: Check cancellation after SwitchToMainThreadAsync
cs: Zkontrolovat zrušení po metodě SwitchToMainThreadAsync
