Repository: Microsoft/vs-threading
Catalog: src/Microsoft.VisualStudio.Threading.Analyzers/xlf/Strings.*.xlf
Languages: es, fr, pl, tr

# VSTHRD112_MessageFormat
source: Implement the System.IAsyncDisposable interface when implementing the obsolete Microsoft.VisualStudio.Threading.IAsyncDisposable interface.
es: Implemente la interfaz de System.IAsyncDisposable al implementar la interfaz de Microsoft.VisualStudio.Threading.IAsyncDisposable obsoleta.
fr: Implémentez l'interface System.IAsyncDisposable quand vous implémentez l'interface Microsoft.VisualStudio.Threading.IAsyncDisposable obsolète.
pl: Zaimplementuj interfejs System.IAsyncDisposable, gdy implementujesz przestarzały interfejs Microsoft.VisualStudio.Threading.IAsyncDisposable.
tr: Eski Microsoft.VisualStudio.Threading.IAsyncDisposable arabirimini uygularken System.IAsyncDisposable arabirimini uygulayın.

# VSTHRD112_Title
source: Implement System.IAsyncDisposable
es: Implementar System.IAsyncDisposable
fr: Implémentez System.IAsyncDisposable
pl: Zaimplementuj interfejs System.IAsyncDisposable
tr: System.IAsyncDisposable arabirimini uygula

# VSTHRD113_MessageFormat
source: Add a check for System.IAsyncDisposable in the same code block that checks for Microsoft.VisualStudio.Threading.IAsyncDisposable that behaves similarly.
es: Agregue una comprobación para System.IAsyncDisposable en el mismo bloque de código que busca Microsoft.VisualStudio.Threading.IAsyncDisposable que se comporta de forma similar.
fr: Ajoutez une vérification de System.IAsyncDisposable dans le même bloc de code qui vérifie Microsoft.VisualStudio.Threading.IAsyncDisposable dont le comportement est similaire.
pl: Dodaj sprawdzenie obecności interfejsu System.IAsyncDisposable w tym samym bloku kodu, który sprawdza obecność interfejsu Microsoft.VisualStudio.Threading.IAsyncDisposable zachowującego się podobnie.
tr: Microsoft.VisualStudio.Threading.IAsyncDisposable için benzer şekilde davranıp davranmadığını denetleyen aynı kod bloğunda System.IAsyncDisposable için bir denetim ekleyin.

# VSTHRD113_Title
source: Check for System.IAsyncDisposable
es: Buscar System.IAsyncDisposable
fr: Vérifier System.IAsyncDisposable
pl: Sprawdź obecność interfejsu System.IAsyncDisposable
tr: System.IAsyncDisposable olup olmadığını denetle

# VSTHRD114_CodeFix_CompletedTask
source: Use 'Task.CompletedTask' instead
es: Usar "Task.CompletedTask" en su lugar
fr: Utiliser 'Task.CompletedTask' à la place
pl: Zamiast tego użyj właściwości „Task.CompletedTask”
tr: Bunun yerine 'Task.CompletedTask' kullanın

# VSTHRD114_CodeFix_FromResult
source: Use 'Task.FromResult' instead
es: Usar "Task.FromResult" en su lugar
fr: Utiliser 'Task.FromResult' à la place
pl: Zamiast tego użyj metody „Task.FromResult”
tr: Bunun yerine 'Task.FromResult' kullanın

# VSTHRD114_MessageFormat
source: Avoid returning null from a Task-returning method.
es: Impida que se devuelva un valor nulo desde un método de devolución de Task.
fr: Évitez de retourner la valeur null pour une méthode qui retourne une tâche.
pl: Unikaj zwracania wartości null z metody zwracającej zadanie.
tr: Bir Görev döndürme metodundan null döndürmekten kaçının.

# VSTHRD114_Title
source: Avoid returning a null Task
es: Impedir la devolución de un tipo Task nulo
fr: Éviter de retourner une tâche null
pl: Unikaj zwracania zadania o wartości null
tr: Null Görev döndürmekten kaçının

# VSTHRD200_AddAsync_MessageFormat
source: Use "Async" suffix in names of methods that return an awaitable type.
es: Use el sufijo "Async" en nombres de métodos que devuelven un tipo que admite await.
fr: Utilisez le suffixe "Async" dans les noms des méthodes qui retournent un type awaitable.
pl: Używaj sufiksu „Async” w nazwach metod zwracających typ awaitable.
tr: Beklenebilir bir tür döndüren metotların adlarında “Async” ekini kullanın.

# VSTHRD200_CodeFix_Title
source: Rename to {0}
es: Cambie el nombre a {0}
fr: Renommer en {0}
pl: Zmień nazwę na: {0}
tr: {0} olarak yeniden adlandırın

# VSTHRD200_RemoveAsync_MessageFormat
source: Avoid "Async" suffix in names of methods that do not return an awaitable type.
es: Evite el sufijo "Async" en nombres de métodos que no devuelven un tipo que admite await.
fr: Évitez le suffixe "Async" dans les noms des méthodes qui ne retournent pas un type awaitable
pl: Unikaj sufiksu „Async” w nazwach metod nie zwracających typu awaitable.
tr: Beklenebilir bir tür döndürmeyen metotların adlarında “Async” ekini kullanmaktan kaçının.

# VSTHRD200_Title
source: Use "Async" suffix for async methods
es: Use el sufijo "Async" para métodos asincrónicos
fr: Utiliser le suffixe "Async" pour les méthodes asynchrones
pl: W przypadku metod asynchronicznych używaj sufiksu „Async”
tr: Async metotları için "Async" sonekini kullanın

# VSTHRD201_CodeFix_Title
source: Call ThrowIfCancellationRequested()
es: Llamar a ThrowIfCancellationRequested()
fr: Appeler ThrowIfCancellationRequested()
pl: Wywoływanie metody ThrowIfCancellationRequested()
tr: ThrowIfCancellationRequested() Çağır

# VSTHRD201_MessageFormat
source: Check for cancellation after calling SwitchToMainThreadAsync(CancellationToken).
es: Compruebe la cancelación después de llamar a SwitchToMainThreadAsync(CancellationToken).
fr: Vérifiez l’annulation après l’appel de SwitchToMainThreadAsync (CancellationToken).
pl: Sprawdź pod kątem anulowania po wywołaniu metody SwitchToMainThreadAsync(CancellationToken).
tr: SwitchToMainThreadAsync(CancellationToken) metodu çağrıldıktan sonra iptal edilip edilmediğini denetleyin.

# VSTHRD201_Title
source: Check cancellation after SwitchToMainThreadAsync
es: Comprobar cancelación después de SwitchToMainThreadAsync
fr: Vérifier l’annulation après SwitchToMainThreadAsync
pl: Sprawdzanie anulowania po metodzie SwitchToMainThreadAsync
tr: SwitchToMainThreadAsync metodundan sonra iptal edilip edilmediğini denetle
