Repository: microsoft/vs-threading
Catalog: src/Microsoft.VisualStudio.Threading.Analyzers/MultilingualResources/Microsoft.VisualStudio.Threading.Analyzers.*.xlf
Languages: pl

# AwaitXInstead
source: Await {0} instead
pl: Zamiast tego oczekuj na {0}

source: Use await instead
pl: Zamiast tego używaj oczekiwania

# VSTHRD002_MessageFormat
source: Synchronously waiting on tasks or awaiters may cause deadlocks. Use await or JoinableTaskFactory.Run instead.
pl: Synchroniczne oczekiwanie na zadania lub elementy typu awaiter mogą powodować zakleszczenia. Zamiast tego używaj metody await lub JoinableTaskFactory.Run.

# VSTHRD002_Title
source: Avoid problematic synchronous waits
pl: Unikaj problematycznych oczekiwań synchronicznych

# VSTHRD010_MessageFormat
source: The type "{0}" should be used on main thread explicitly. Call {1}() or await JoinableTaskFactory.SwitchToMainThreadAsync() first.
pl: Usługa programu Visual Studio „{0}” powinna być używana w wątku głównym w sposób jawny. Najpierw wywołaj metodę ThreadHelper.ThrowIfNotOnUIThread() lub oczekuj na metodę JoinableTaskFactory.SwitchToMainThreadAsync().

# VSTHRD010_Title
source: Invoke single-threaded types on Main thread
pl: Używaj usług programu VS z wątku interfejsu użytkownika

# VSTHRD100_MessageFormat
source: Avoid "async void" methods, because any exceptions not handled by the method will crash the process.
pl: Unikaj metod „async void”, ponieważ wszelkie wyjątki, które nie zostaną przez nie obsłużone, spowodują awarię procesu.

# VSTHRD100_Title
source: Avoid async void methods
pl: Unikaj metod „async void”

# VSTHRD101_MessageFormat
source: Avoid using async lambda for a void returning delegate type, because any exceptions not handled by the delegate will crash the process.
pl: Unikaj używania asynchronicznego wyrażenia lambda dla typu delegata zwracającego „void”, ponieważ wszelkie wyjątki, które nie zostaną obsłużone przez delegata, spowodują awarię procesu.

# VSTHRD101_Title
source: Avoid unsupported async delegates
pl: Unikaj nieobsługiwanych delegatów asynchronicznych

# VSTHRD106_MessageFormat
source: AsyncEventHandler delegates should be invoked via the extension method "TplExtensions.InvokeAsync()" defined in Microsoft.VisualStudio.Threading assembly.
pl: Delegatów AsyncEventHandler powinno się wywoływać za pośrednictwem metody rozszerzenia „TplExtensions.InvokeAsync()” zdefiniowanej w zestawie Microsoft.VisualStudio.Threading.

# VSTHRD106_Title
source: Use InvokeAsync to raise async events
pl: Zdarzenia asynchroniczne wywołuj za pomocą metody InvokeAsync

# VSTHRD003_MessageFormat
source: Calling await on a Task inside a JoinableTaskFactory.Run, when the task is initialized outside the delegate can cause potential deadlocks. You can avoid this problem by ensuring the task is initialized within the delegate or by using JoinableTask instead of Task.
pl: Wywołanie oczekiwania dla obiektu Task wewnątrz metody JoinableTaskFactory.Run, gdy dane zadanie zainicjowano poza delegatem, może spowodować zakleszczenia. Tego problemu można uniknąć, zapewniając, że zadanie zostanie zainicjowane wewnątrz delegata lub za pomocą klasy JoinableTask (a nie klasy Task).

# VSTHRD003_Title
source: Avoid awaiting non-joinable tasks in join contexts
pl: Unikaj oczekiwania na zadania bez możliwości dołączenia w kontekstach dołączania

# VSTHRD011_MessageFormat
source: Lazy<Task<T>>.Value can deadlock. Use AsyncLazy<T> instead.
pl: Element Lazy<Task<T>>.Value może ulec zakleszczeniu. Zamiast tego używaj klasy AsyncLazy<T>.

# VSTHRD011_Title
source: Avoid using Lazy<T> where T is a Task<T2>
pl: Unikaj używania klasy Lazy<T>, jeśli T jest obiektem Task<T2>

# VSTHRD103_MessageFormat
source: {0} synchronously blocks. Await {1} instead.
pl: Metoda {0} powoduje blokowanie synchroniczne. Zamiast tego oczekuj na {1}.

# VSTHRD103_MessageFormat_UseAwaitInstead
source: {0} synchronously blocks. Use await instead.
pl: Metoda {0} powoduje blokowanie synchroniczne. Zamiast tego używaj oczekiwania.

# VSTHRD103_Title
source: Call async methods when in an async method
pl: W metodach asynchronicznych wywołuj metody asynchroniczne

# VSTHRD102_MessageFormat
source: Limit use of synchronously blocking method calls such as JoinableTaskFactory.Run or Task.Result to public entrypoint members where you must be synchronous. Using it for internal members can needlessly add synchronous frames between asynchronous frames, leading to threadpool exhaustion.
pl: Ogranicz stosowanie wywołań metod z blokowaniem synchronicznym, takich jak JoinableTaskFactory.Run lub Task.Result, do publicznych elementów członkowskich punktów wyjścia, w przypadku których konieczne jest działanie synchroniczne. Stosowanie tego rozwiązania w przypadku wewnętrznych elementów członkowskich może powodować niepotrzebne dodawanie ramek synchronicznych między ramkami asynchronicznymi, co może prowadzić do wyczerpania puli wątków.

# VSTHRD102_Title
source: Implement internal logic asynchronously
pl: Logikę wewnętrzną implementuj asynchronicznie

# VSTHRD200_CodeFix_Title
source: Rename to {0}
pl: Zmień nazwę na: {0}

# VSTHRD200_MessageFormat
source: Use "Async" suffix in names of Task-returning methods.
pl: W nazwach metod zwracających obiekty Task używaj sufiksu „Async”.

# VSTHRD200_Title
source: Use "Async" suffix for async methods
pl: W przypadku metod asynchronicznych używaj sufiksu „Async”

# VSTHRD105_MessageFormat
source: Avoid method overloads that assume TaskScheduler.Current. Use an overload that accepts a TaskScheduler and specify TaskScheduler.Default (or any other) explicitly.
pl: Unikaj przeciążeń metod zakładających korzystanie z właściwości TaskScheduler.Current. Używaj przeciążenia przyjmującego obiekt TaskScheduler i jawnie określaj właściwość TaskScheduler.Default (lub inną).

# VSTHRD105_Title
source: Avoid method overloads that assume TaskScheduler.Current
pl: Unikaj przeciążeń metod zakładających korzystanie z właściwości TaskScheduler.Current

# VSTHRD100_CodeFix_Title
source: Change return type to Task
pl: Zmień zwracany typ na Task

# VSTHRD012_MessageFormat
source: Provide an instance of JoinableTaskFactory in this call (or another overload) to avoid deadlocks with the main thread.
pl: Podaj wystąpienie elementu JoinableTaskFactory w tym wywołaniu (albo innym przeciążeniu), aby uniknąć zakleszczeń w wątku głównym.

# VSTHRD012_Title
source: Provide JoinableTaskFactory where allowed
pl: Podaj element JoinableTaskFactory w miejscach, gdzie jest to dopuszczalne

# VSTHRD104_MessageFormat
source: Expose an async version of this method that does not synchronously block. Then simplify this method to call that async method within a JoinableTaskFactory.Run delegate.
pl: Uwidocznij asynchroniczną wersję tej metody, która nie powoduje synchronicznego blokowania. Następnie uprość tę metodę, aby wywołać tę metodę asynchroniczną w ramach delegata JoinableTaskFactory.Run.

# VSTHRD104_Title
source: Offer async methods
pl: Oferuj metody asynchroniczne

# VSTHRD001_MessageFormat
source: Await JoinableTaskFactory.SwitchToMainThreadAsync() to switch to the UI thread instead of APIs that can deadlock or require specifying a priority.
pl: Zaczekaj, aż metoda JoinableTaskFactory.SwitchToMainThreadAsync() przełączy się do wątku interfejsu użytkownika zamiast interfejsów API, które mogą ulec zakleszczeniu lub wymagać określenia priorytetu.

# VSTHRD001_Title
source: Avoid legacy thread switching APIs
pl: Unikaj starszych interfejsów API przełączających wątki

# VSTHRD107_MessageFormat
source: Missing await operator for "using" expression.
pl: Brak operatora await dla wyrażenia „using”.

# VSTHRD107_Title
source: Await Task within using expression
pl: Oczekuj na zadanie wewnątrz wyrażenia using

# VSTHRD107_CodeFix_Title
source: Await using expression
pl: Oczekuj w wyrażeniu using

# VSTHRD002_CodeFix_Await_Title
source: Use await instead
pl: Zamiast tego używaj oczekiwania
