Repository: microsoft/vs-threading
Catalog: src/Microsoft.VisualStudio.Threading/xlf/Strings.*.xlf
Languages: de

# AppliedSynchronizationContextNotAllowed
source: Acquiring locks on threads with a SynchronizationContext applied is not allowed.
de: Das Abrufen von Sperren für Threads, auf die ein SynchronizationContext angewendet wurde, ist unzulässig.

# CannotUpgradeNonUpgradeableLock
source: A non-upgradeable read lock is held by the caller and cannot be upgraded.
de: Eine nicht aktualisierbare Lesesperre wird vom Aufrufer gehalten und kann nicht aktualisiert werden.

# DangerousReadLockRequestFromWriteLockFork
source: Dangerous request for read lock from fork of write lock.
de: Gefährliche Anforderung einer Lesesperre von der Verzweigung einer Schreibsperre.

# FrameMustBePushedFirst
source: This instance must be pushed first.
de: Diese Instanz muss zuerst gepusht werden.

# InvalidAfterCompleted
source: Already transitioned to the Completed state.
de: Der Übergang in den Status "Abgeschlossen" ist bereits erfolgt.

# InvalidLock
source: This operation can only be executed against a valid lock.
de: Dieser Vorgang kann nur für eine gültige Sperre ausgeführt werden.

# InvalidWithoutLock
source: A lock is required.
de: Eine Sperre ist erforderlich.

# JoinableTaskContextAndCollectionMismatch
source: JoinableTask does not belong to the context this collection was instantiated with.
de: JoinableTask gehört nicht zu dem Kontext, mit dem diese Sammlung instanziiert wurde.

# JoinableTaskContextNodeAlreadyRegistered
source: This node already registered.
de: Dieser Knoten ist bereits registriert.

# LazyValueFaulted
source: Lazily created value faulted during construction.
de: Fehler bei verzögert erstelltem Wert während der Konstruktion.

# LazyValueNotCreated
source: Lazily created value not yet constructed.
de: Es wurde noch kein verzögert erstellter Wert konstruiert.

# LockCompletionAlreadyRequested
source: This lock has already been marked for completion. No new top-level locks can be serviced.
de: Diese Sperre wurde bereits für den Abschluss markiert. Es können keine neuen Sperren auf oberster Ebene verarbeitet werden.

# NotAllowedUnderURorWLock
source: This operation is not allowed while holding an active upgradeable read or write lock from an AsyncReaderWriterLock.
de: Dieser Vorgang ist unzulässig, wenn eine aktive und aktualisierbare Lese- oder Schreibsperre durch ein AsyncReaderWriterLock-Objekt aufrecht erhalten wird.

# PushFromWrongThread
source: Message pump can only be run from the original thread.
de: Die Ereignisschleife kann nur über den ursprünglichen Thread ausgeführt werden.

# QueueEmpty
source: The queue is empty.
de: Die Warteschlange ist leer.

# STAThreadCallerNotAllowed
source: This operation cannot be completed on an STA thread.
de: Dieser Vorgang kann in einem STA-Thread nicht abgeschlossen werden.

# SemaphoreMisused
source: This semaphore has been misused and can no longer be used.
de: Dieser Semaphor wurde falsch verwendet und kann nicht länger genutzt werden.

# SemaphoreStackNestingViolated
source: Nested semaphore requests must be released in LIFO order when the reentrancy setting is: '{0}'
de: Geschachtelte Semaphoranforderungen müssen in LIFO-Reihenfolge angegeben werden, wenn die Einstellung für die Eintrittsinvarianz "{0}" lautet.

# SwitchToMainThreadFailedToReachExpectedThread
source: An attempt to switch to the main thread failed to reach the expected thread. Was the JoinableTaskContext initialized on the wrong thread or with a SynchronizationContext whose Post method does not execute its delegate on the main thread?
de: Fehler beim Versuch, zum Hauptthread zu wechseln, um den erwarteten Thread zu erreichen. Wurde der JoinableTaskContext für den falschen Thread oder mit einem SynchronizationContext initialisiert, dessen Post-Methode ihren Delegaten nicht für den Hauptthread ausführt?

# SyncContextFrameMismatchedAffinity
source: This frame has already been used with a different instance.
de: Dieser Frame wurde bereits mit einer anderen Instanz verwendet.

# ValueFactoryReentrancy
source: The value factory has called for the value on the same instance.
de: Die Wertfactory hat den Wert für die gleiche Instanz aufgerufen.
