Repository: microsoft/vs-threading
Catalog: src/Microsoft.VisualStudio.Threading/MultilingualResources/Microsoft.VisualStudio.Threading.Desktop.*.xlf
Languages: cs, ja

# AppliedSynchronizationContextNotAllowed
source: Acquiring locks on threads with a SynchronizationContext applied is not allowed.
cs: Získání zámků vláken s použitým kontextem synchronizace není povolené.
ja: SynchronizationContext を適用したスレッド上でのロックの取得は許可されていません。

# CannotUpgradeNonUpgradeableLock
source: A non-upgradeable read lock is held by the caller and cannot be upgraded.
cs: Volající nastavil neupgradovatelný zámek čtení. Nelze provést jeho upgrade.
ja: アップグレードできない読み取りロックが呼び出し元によって設定されているため、アップグレードできません。

# DangerousReadLockRequestFromWriteLockFork
source: Dangerous request for read lock from fork of write lock.
cs: Nebezpečná žádost o čtení zámků z větve zámku zápisu
ja: 書き込みロックのフォークからの、危険性のある読み取りロック要求です。

# InvalidAfterCompleted
source: Already transitioned to the Completed state.
cs: Už přešlo do stavu Dokončeno.
ja: 完了済みの状態へ既に移行されています。

# InvalidLock
source: This operation can only be executed against a valid lock.
cs: Tuto operaci lze provést pouze v případě platného zámku.
ja: この操作は有効なロックに対してのみ実行できます。

# InvalidWithoutLock
source: A lock is required.
cs: Vyžaduje se zámek.
ja: ロックが必要です。

# JoinableTaskContextAndCollectionMismatch
source: JoinableTask does not belong to the context this collection was instantiated with.
cs: Připojitelný úkol nepatří do kontextu, v jakém se vytvořila instance této kolekce.
ja: JoinableTask はこのコレクションがインスタンス化されたコンテキストに属していません。

# JoinableTaskContextNodeAlreadyRegistered
source: This node already registered.
cs: Tento uzel je už zaregistrovaný.
ja: このノードは登録済みです。

# LazyValueFaulted
source: Lazily created value faulted during construction.
cs: Laxně vytvářená hodnota byla při vytváření vyhodnocena jako chybná.
ja: 遅延作成値の作成中にエラーが発生しました。

# LazyValueNotCreated
source: Lazily created value not yet constructed.
cs: Laxně vytvářená hodnota ještě nebyla vytvořena.
ja: 遅延作成値はまだ作成されていません。

# LockCompletionAlreadyRequested
source: This lock has already been marked for completion. No new top-level locks can be serviced.
cs: Tento zámek již byl označen k dokončení. Nelze obsloužit žádné nové zámky na nejvyšší úrovni.
ja: このロックは既に完了対象に設定されています。新しいトップレベルのロックは提供できません。

# NotAllowedUnderURorWLock
source: This operation is not allowed while holding an active upgradeable read or write lock from an AsyncReaderWriterLock.
cs: Tato operace není povolena, pokud je aktivní upgradovatelný zámek čtení nebo zápisu z AsyncReaderWriterLock.
ja: AsyncReaderWriterLock から、アクティブでアップグレード可能な読み取りロックまたは書き込みロックを保持している間は、この操作を行うことができません。

# QueueEmpty
source: The queue is empty.
cs: Tato fronta je prázdná.
ja: キューが空です。

# STAThreadCallerNotAllowed
source: This operation cannot be completed on an STA thread.
cs: Tato operace se nedá dokončit ve vlákně STA.
ja: この操作は STA スレッドでは完了できません。

# SwitchToMainThreadFailedToReachExpectedThread
source: An attempt to switch to the main thread failed to reach the expected thread. Was the JoinableTaskContext initialized on the wrong thread or with a SynchronizationContext whose Post method does not execute its delegate on the main thread?
cs: Při pokusu o přepnutí na hlavní vlákno se nepodařilo připojení k očekávanému vláknu. Byl objekt JoinableTaskContext inicializován na chybném vlákně nebo s objektem SynchronizationContext, jehož metoda Post nespouští jeho delegáta v hlavním vláknu?
ja: メイン スレッドへ切り替えを試みましたが、必要なスレッドに到達できませんでした。JoinableTaskContext が正しくないスレッドで初期化されましたか? あるいは、メイン スレッドでデリゲートを実行しない POST メソッドを持つ SynchronizationContext が関連付けられていますか?

# ValueFactoryReentrancy
source: The value factory has called for the value on the same instance.
cs: Objekt pro vytváření hodnot zavolal hodnotu pro stejnou instanci.
ja: 値ファクトリが同じインスタンスの値を呼び出しました。
