Repository: microsoft/vs-threading
Catalog: src/Microsoft.VisualStudio.Threading/Strings.*.resx
Languages: es, fr, it, pl, pt_br

# AppliedSynchronizationContextNotAllowed
source: Acquiring locks on threads with a SynchronizationContext applied is not allowed.
es: No se permite adquirir bloqueos en subprocesos con un SynchronizationContext aplicado.
fr: L'acquisition de verrous sur des threads avec application d'un SynchronizationContext n'est pas autorisée.
it: Non è consentito acquisire blocchi su thread in cui è applicato un elemento SynchronizationContext.
pl: Uzyskiwanie blokad wątków z zastosowanym ustawieniem SynchronizationContext nie jest dozwolone.
pt_br: Não é permitido adquirir bloqueios em threads com SynchronizationContext aplicado.

# CannotUpgradeNonUpgradeableLock
source: A non-upgradeable read lock is held by the caller and cannot be upgraded.
es: El llamador mantiene un bloqueo de lectura no actualizable y no se puede actualizar.
fr: L'appelant possède un verrou en lecture qui ne peut pas être mis à niveau et la mise à niveau est impossible.
it: Il chiamante mantiene un blocco lettura non aggiornabile, di conseguenza non è possibile aggiornarlo.
pl: Niemożliwa do uaktualnienia blokada odczytu jest trzymana przez wywołującego i nie może zostać uaktualniona.
pt_br: Um bloqueio de leitura não atualizável é mantido pelo chamador e não pode ser atualizado.

# DangerousReadLockRequestFromWriteLockFork
source: Dangerous request for read lock from fork of write lock.
es: Solicitud peligrosa para bloqueo de lectura desde bifurcación de bloqueo de escritura.
fr: Demande dangereuse de verrou en lecture à partir d'une bifurcation d'un verrou en écriture.
it: La biforcazione del blocco scrittura ha effettuato una richiesta pericolosa per il blocco lettura.
pl: Niebezpieczne żądanie blokady odczytu z rozwidlenia po żądaniu blokady zapisu.
pt_br: Solicitação perigosa para bloqueio de leitura na bifurcação do bloqueio de gravação.

# InvalidAfterCompleted
source: Already transitioned to the Completed state.
es: Ya se ha realizado la transición al estado Completado.
fr: Déjà passé à l'état Terminé.
it: Il passaggio allo stato Completato è già stato eseguito.
pl: Nastąpiło już przejście do stanu Ukończone.
pt_br: Transição já efetuada para o estado Concluído.

# InvalidLock
source: This operation can only be executed against a valid lock.
es: Esta operación solamente se puede ejecutar con un bloqueo válido.
fr: Cette opération peut seulement être exécutée sur un verrou valide.
it: Questa operazione può essere eseguita solo su un blocco valido.
pl: Operacja może zostać wykonana tylko w stosunku do prawidłowej blokady.
pt_br: Esta operação só pode ser executada em um bloqueio válido.

# InvalidWithoutLock
source: A lock is required.
es: Se necesita un bloqueo.
fr: Un verrou est requis.
it: È richiesto un blocco.
pl: Wymagana jest blokada.
pt_br: É necessário um bloqueio.

# JoinableTaskContextAndCollectionMismatch
source: JoinableTask does not belong to the context this collection was instantiated with.
es: JoinableTask no pertenece al contexto con el que se creó la instancia de esta colección.
fr: JoinableTask n'appartient pas au contexte avec lequel cette collection a été instanciée.
it: JoinableTask non appartiene al contesto con cui è stata creata un'istanza di questa raccolta.
pl: Zadanie JoinableTask nie należy do kontekstu, w którym utworzono wystąpienie tej kolekcji.
pt_br: JoinableTask não pertence ao contexto com o qual esta coleção foi instanciada.

# JoinableTaskContextNodeAlreadyRegistered
source: This node already registered.
es: Este nodo ya está registrado.
fr: Ce nœud est déjà inscrit.
it: Questo nodo è già registrato.
pl: Ten węzeł jest już zarejestrowany.
pt_br: Este nó já está registrado.

# LazyValueFaulted
source: Lazily created value faulted during construction.
es: Error del valor creado de forma diferida durante la construcción.
fr: La valeur créée tardivement a provoqué un échec pendant la construction.
it: Si è verificato un errore durante la costruzione del valore creato in modo differito.
pl: Wystąpił błąd podczas tworzenia wartości z opóźnieniem.
pt_br: O valor criado de forma lenta apresentou falha durante a construção.

# LazyValueNotCreated
source: Lazily created value not yet constructed.
es: El valor creado de forma diferida no se ha construido aún.
fr: La valeur créée tardivement n'a pas encore été construite.
it: Il valore creato in modo differito non è stato ancora costruito.
pl: Wartość tworzona z opóźnieniem nie została jeszcze utworzona.
pt_br: O valor criado de forma lenta ainda não foi construído.

# LockCompletionAlreadyRequested
source: This lock has already been marked for completion. No new top-level locks can be serviced.
es: Este bloqueo ya se ha marcado para su finalización. No se pueden mantener nuevos bloqueos de nivel superior.
fr: Ce verrou a déjà été marqué pour achèvement. Aucun nouveau verrou de niveau supérieur ne peut être pris en charge.
it: Questo blocco è già stato contrassegnato per il completamento. Non è possibile eseguire nuovi blocchi di primo livello.
pl: Ta blokada została już oznaczona do ukończenia. Nie można obsłużyć żadnych nowych blokad najwyższego poziomu.
pt_br: Este bloqueio já foi marcado para conclusão. Nenhum bloqueio de nível superior pode ser atendido.

# NotAllowedUnderURorWLock
source: This operation is not allowed while holding an active upgradeable read or write lock from an AsyncReaderWriterLock.
es: Esta operación no está permitida mientras se mantenga un bloqueo activo de lectura o escritura actualizable a través de un AsyncReaderWriterLock.
fr: Cette opération n'est pas autorisée durant l'application d'un verrou actif en lecture ou en écriture pouvant être mis à niveau à partir de AsyncReaderWriterLock.
it: Questa operazione non è consentita quando si mantiene un blocco lettura o scrittura aggiornabile attivo da un elemento AsyncReaderWriterLock.
pl: Ta operacja nie jest dozwolona w trakcie trzymania aktywnej, możliwej do uaktualniania blokady odczytu lub zapisu z elementu AsyncReaderWriterLock.
pt_br: Esta operação não é permitida ao manter uma leitura atualizável ativa ou um bloqueio de gravação de um AsyncReaderWriterLock.

# QueueEmpty
source: The queue is empty.
es: La cola está vacía.
fr: La file d'attente est vide.
it: La coda è vuota.
pl: Kolejka jest pusta.
pt_br: A fila está vazia.

# STAThreadCallerNotAllowed
source: This operation cannot be completed on an STA thread.
es: Esta operación no se puede completar en un subproceso STA.
fr: Impossible d'achever cette opération sur un thread STA.
it: Non è possibile completare questa operazione su un thread STA.
pl: Nie można ukończyć tej operacji w wątku STA.
pt_br: Esta operação não pode ser concluída em um thread STA.

# SwitchToMainThreadFailedToReachExpectedThread
source: An attempt to switch to the main thread failed to reach the expected thread. Was the JoinableTaskContext initialized on the wrong thread or with a SynchronizationContext whose Post method does not execute its delegate on the main thread?
es: No se pudo alcanzar el subproceso esperado a través del intento de cambio al subproceso principal. ¿Se inició JoinableTaskContext en el subproceso incorrecto o con un SynchronizationContext cuyo método de registro no ejecuta su delegado en el subproceso principal?
fr: Une tentative de basculement sur le thread principal n’a pas réussi à atteindre le thread attendu. JoinableTaskContext a-t-il été initialisé sur le mauvais thread ou avec un SynchronizationContext dont la méthode Post n’exécute pas son délégué sur le thread principal ?
it: Un tentativo di passare al thread principale per raggiungere il thread previsto non è riuscito. JoinableTaskContext era inizializzato nel thread errato oppure con un elemento SynchronizationContext il cui metodo Post non esegue il relativo delegato nel thread principale?
pl: Próba przełączenia się na główny wątek zakończyła się niepowodzeniem. Nie udało się osiągnąć oczekiwanego wątku. Czy element JoinableTaskContext został zainicjowany w niewłaściwym wątku albo z kontekstem SynchronizationContext, którego metoda Post nie uruchamia swojego delegata w wątku głównym?
pt_br: Uma tentativa de mudar para o thread principal falhou ao alcançar o thread esperado. O JoinableTaskContext foi inicializado no thread incorreto ou com um SynchronizationContext cujo método Post não executa seu delegado no thread principal?

# ValueFactoryReentrancy
source: The value factory has called for the value on the same instance.
es: Este generador de valores ha llamado al valor en la misma instancia.
fr: La fabrique de valeurs a fait appel à la valeur sur la même instance.
it: La factory del valore ha richiesto il valore nella stessa istanza.
pl: Fabryka wartości zażądała wartości w tym samym wystąpieniu.
pt_br: O alocador de valor chamou o valor na mesma instância.
