Repository: microsoft/vs-threading
Catalog: src/Microsoft.VisualStudio.Threading.Analyzers/Strings.*.resx
Languages: de, es, fr, it, ja, ko, pt_br, ru, tr, zh_hans, zh_hant

# VSTHRD105_MessageFormat
source: Avoid method overloads that assume TaskScheduler.Current. Use an overload that accepts a TaskScheduler and specify TaskScheduler.Default (or any other) explicitly.
de: Vermeiden Sie Methodenüberladungen, die "TaskScheduler.Current" annehmen. Verwenden Sie eine Überladung, die einen TaskScheduler akzeptiert, und geben Sie explizit "TaskScheduler.Default" (o. a.) an.
es: Evite las sobrecargas de métodos que asumen TaskScheduler.Current. Use una sobrecarga que acepte un elemento TaskScheduler y especifique TaskScheduler.Default (o cualquier otro) explícitamente.
fr: Évitez les surcharges de méthode qui optent par défaut pour TaskScheduler.Current. Utilisez une surcharge qui accepte un TaskScheduler et spécifiez TaskScheduler.Default (ou autre chose) de manière explicite.
it: Evitare gli overload di metodo che presuppongono TaskScheduler.Current. Usare un overload che accetta un elemento TaskScheduler e specificare TaskScheduler.Default (o qualsiasi altro elemento) in modo esplicito.
ja: TaskScheduler.Current を仮定するメソッド オーバーロードを使用しないでください。TaskScheduler を受け入れるオーバーロードを使用し、TaskScheduler.Default (または他のプロパティ) を明示的に指定します。
ko: TaskScheduler.Current를 가정하는 메서드 오버로드를 사용하지 않습니다. TaskScheduler를 수용하고 TaskScheduler.Default(또는 기타)를 명시적으로 지정하는 오버로드를 사용합니다.
pt_br: Evite sobrecargas de método que assumem TaskScheduler. Use uma sobrecarga que aceita um TaskScheduler e especificar explicitamente o TaskScheduler (ou qualquer outro).
ru: Избегайте перегрузок методов, предполагающих TaskScheduler.Current. Используйте перегрузку, которая допускает TaskScheduler, и явно укажите свойство TaskScheduler.Default (или любое другое).
tr: TaskScheduler.Current varsayan metot aşırı yüklemelerinden kaçının. TaskScheduler kabul eden bir aşırı yükleme kullanın ve TaskScheduler.Default (veya başka birini) açık olarak belirtin.
zh_hans: 避免假定 TaskScheduler.Current 的方法重载。使用接受 TaskScheduler 的重载并显式指定 TaskScheduler.Default（或其他方法）。
zh_hant: 請避免會假設 TaskScheduler.Current 的方法多載。請使用接受 TaskScheduler 的多載，並明確指定 TaskScheduler.Default (或其他任一項)。

# VSTHRD105_Title
source: Avoid method overloads that assume TaskScheduler.Current
de: Methodenüberladungen, die TaskScheduler.Current annehmen, vermeiden
es: Evite las sobrecargas de métodos que asumen TaskScheduler.Current
fr: Éviter les surcharges de méthode qui optent par défaut pour TaskScheduler.Current
it: Evita overload di metodo che presuppongono TaskScheduler.Current
ja: TaskScheduler.Current を仮定するメソッド オーバーロードを使用しない
ko: TaskScheduler.Current를 가정하는 메서드 오버로드를 사용하지 않습니다.
pt_br: Evitar sobrecargas de método que assumem TaskScheduler
ru: Избегание перегрузок методов, предполагающих TaskScheduler.Current
tr: TaskScheduler.Current varsayan metot aşırı yüklemelerinden kaçının
zh_hans: 避免假定 TaskScheduler.Current 的方法重载
zh_hant: 避免假設 TaskScheduler.Current 的方法多載

# VSTHRD100_CodeFix_Title
source: Change return type to Task
de: Rückgabetyp in Task ändern
es: Cambie el tipo de valor devuelto a Task
fr: Remplacer le type de retour par Task
it: Cambia tipo restituito in Task
ja: 戻り値の型を Task に変更する
ko: 반환 형식을 Task로 변경
pt_br: Tipo de retorno da mudança de tarefa
ru: Изменение типа возвращаемого значения на Task
tr: Döndürme türünü Task olarak değiştirin
zh_hans: 将返回类型更改为 Task
zh_hant: 將傳回類型變更為 Task

# VSTHRD012_MessageFormat
source: Provide an instance of JoinableTaskFactory in this call (or another overload) to avoid deadlocks with the main thread
de: Stellen Sie in diesem Aufruf (oder einer anderen Überladung) eine Instanz von "JoinableTaskFactory" bereit, um Deadlocks beim Hauptthread zu vermeiden.
es: Proporcione una instancia de JoinableTaskFactory en esta llamada (u otra sobrecarga) para evitar interbloqueos con el subproceso principal.
fr: Fournissez une instance de JoinableTaskFactory dans cet appel (ou une autre surcharge) pour éviter les blocages avec le même thread.
it: Specificare in questa chiamata un'istanza di JoinableTaskFactory o di un altro overload per evitare deadlock con il thread principale.
ja: この呼び出し (または別のオーバーロード) で JoinableTaskFactory のインスタンスを提供して、メイン スレッドとのデッドロックを回避します。
ko: 주 스레드에서 교착 상태를 방지하려면 이 호출(또는 다른 오버로드)에서 JoinableTaskFactory의 인스턴스를 제공하세요.
ru: Укажите экземпляр JoinableTaskFactory в этом вызове (или другой перегрузке), чтобы избежать взаимоблокировки с основным потоком.
tr: Ana iş parçacığında kilitlenmeleri önlemek için bu çağrıda (veya başka bir aşırı yüklemede) bir JoinableTaskFactory örneği sağlayın.
zh_hans: 在此调用中提供 JoinableTaskFactory 的实例（或其他重载）以避免主线程死锁。
zh_hant: 在此呼叫 (或其他多載) 中提供 JoinableTaskFactory 執行個體，以避免主執行緒發生死結。

# VSTHRD012_Title
source: Provide JoinableTaskFactory where allowed
de: "JoinableTaskFactory" bereitstellen, wenn zulässig
es: Proporcione JoinableTaskFactory donde se permita
fr: Fournir JoinableTaskFactory quand autorisé
it: Specifica JoinableTaskFactory quando consentito
ja: 許可されている場合は JoinableTaskFactory を提供する
ko: 허용되는 경우 JoinableTaskFactory 제공
ru: Указывайте JoinableTaskFactory, где это возможно
tr: İzin veriliyorsa JoinableTaskFactory sağlayın
zh_hans: 在允许的地方提供 JoinableTaskFactory
zh_hant: 在允許的情況下提供 JoinableTaskFactory

# VSTHRD104_MessageFormat
source: Expose an async version of this method that does not synchronously block. Then simplify this method to call that async method within a JoinableTaskFactory.Run delegate.
de: Machen Sie eine asynchrone Version dieser Methode verfügbar, die nicht synchron blockiert. Vereinfachen Sie diese Methode anschließend, um die asynchrone Methode innerhalb eines Delegaten vom Typ "JoinableTaskFactory.Run" aufzurufen.
es: Exponga una versión asincrónica de este método que no cause bloqueo de manera sincrónica. A continuación, simplifique este método para llamar a ese método asincrónico dentro de un delegado JoinableTaskFactory.Run.
fr: Exposez une version asynchrone de cette méthode qui ne se bloque pas de manière synchrone. Ensuite, simplifiez cette méthode pour appeler cette méthode async dans un délégué JoinableTaskFactory.Run.
it: Esporre una versione asincrona di questo metodo che non applica il blocco asincrono. Semplificare quindi questo metodo in modo da chiamare il metodo asincrono in un delegato di JoinableTaskFactory.Run.
ja: このメソッドの、同期的にブロックしない非同期バージョンを公開してください。次に、このメソッドを単純化し、JoinableTaskFactory.Run デリゲート内でその非同期メソッドを呼び出すようにします。
ko: 동기적으로 차단되지 않는 이 메서드의 비동기 버전을 노출하세요. 그런 다음 JoinableTaskFactory.Run 대리자 내의 해당 비동기 메서드를 호출하도록 이 메서드를 단순화하세요.
ru: Предоставьте асинхронную версию этого метода, которая не использует синхронную блокировку. Затем упростите этот метод, вызывая асинхронную версию внутри делегата JoinableTaskFactory.Run.
tr: Bu metodun zaman uyumlu olarak engellemeyen zaman uyumsuz bir sürümünü sunun. Sonra bir JoinableTaskFactory.Run temsilcisi içinde bu zaman uyumsuz metoda çağrı yapmak için bu metodu basitleştirin.
zh_hans: 公开此方法的异步版（不同步阻止）。然后简化此方法以在 JoinableTaskFactory.Run 委托内调用该异步方法。
zh_hant: 提供此方法不會同步封鎖的非同步版本，讓此方法在 JoinableTaskFactory.Run 委派中只呼叫該非同步方法。

# VSTHRD104_Title
source: Offer async methods
de: Asynchrone Methoden bieten
es: Ofrezca métodos asincrónicos
fr: Offrir des méthodes async
it: Offri metodi asincroni
ja: 非同期メソッドを提供する
ko: 비동기 메서드 제공
ru: Предоставляйте асинхронные методы
tr: Zaman uyumsuz metotlar sunun
zh_hans: 提供异步方法
zh_hant: 提供非同步方法

# VSTHRD001_MessageFormat
source: Await JoinableTaskFactory.SwitchToMainThreadAsync() to switch to the UI thread instead of APIs that can deadlock or require specifying a priority
de: Warten Sie darauf, dass "JoinableTaskFactory.SwitchToMainThreadAsync()" zum UI-Thread wechselt anstelle von APIs, bei denen Deadlocks auftreten können oder für die unter Umständen eine Priorität festgelegt werden muss.
es: Use el método await JoinableTaskFactory.SwitchToMainThreadAsync() para cambiar al subproceso de interfaz de usuario en lugar de a API que pueden causar interbloqueo o requerir que se especifique una prioridad.
fr: Attendez que JoinableTaskFactory.SwitchToMainThreadAsync() passe au thread d'interface utilisateur au lieu des API susceptibles de se bloquer ou de demander une priorité.
it: Usare await JoinableTaskFactory.SwitchToMainThreadAsync() per passare al thread dell'interfaccia utente invece di usare API che possono causare deadlock o per le quali è necessario specificare una priorità.
ja: UI スレッドに切り替えるためには、デッドロックを引き起こす可能性や、優先順位の指定の必要がある API を使用するのではなく、JoinableTaskFactory.SwitchToMainThreadAsync() を待機してください。
ko: JoinableTaskFactory.SwitchToMainThreadAsync()가 교착 상태를 일으킬 수 있고 우선 순위를 지정해야 하는 API 대신 UI 스레드로 전환될 때까지 기다립니다.
ru: Дождитесь, когда JoinableTaskFactory.SwitchToMainThreadAsync() переключится на поток пользовательского интерфейса, и не используйте API, которые могут вызывать взаимоблокировки или требуют указания приоритета.
tr: Kilitlenebilen ya da öncelik belirtilmesini gerektiren API’ler yerine JoinableTaskFactory.SwitchToMainThreadAsync() öğesinin UI iş parçacığına geçmesini bekleyin.
zh_hans: 等待 JoinableTaskFactory.SwitchToMainThreadAsync() 切换到 UI 线程，而非切换到可死锁或要求指定优先级的 API。
zh_hant: Await JoinableTaskFactory.SwitchToMainThreadAsync() 可切換至 UI 執行緒，而不會切換至可能會造成死結，或必須指定優先順序的 API。

# VSTHRD001_Title
source: Avoid legacy thread switching APIs
de: Legacy-APIs zum Wechseln von Threads vermeiden
es: Evite cambiar a API de subprocesos heredados
fr: Éviter les API de commutation de thread héritées
it: Evita API legacy per il passaggio a thread
ja: 従来のスレッド切り替え API を使用しない
ko: 레거시 스레드 전환 API 방지
ru: Избегайте использования устаревших API переключения потоков
tr: İş parçacıkları arasında geçiş yapan eski API’lerden kaçının
zh_hans: 避免旧线程切换 API
zh_hant: 避免傳統執行緒切換 API

# VSTHRD107_MessageFormat
source: Missing await operator for "using" expression
de: Der await-Operator für den "using"-Ausdruck fehlt.
es: Falta el operador await en la expresión "using".
fr: Opérateur await manquant pour l’expression "using".
it: Manca l'operatore await per l'espressione "using".
ja: "using" 式に await 演算子がありません。
ko: “using” 식의 await 연산자 누락
ru: Отсутствует оператор await для выражения "using".
tr: “using” ifadesi için await işleci eksik.
zh_hans: "using" 表达式缺少 await 运算符。
zh_hant: "using" 運算式缺少 await 運算子。

# VSTHRD107_Title
source: Await Task within using expression
de: Await Task im using-Ausdruck.
es: Usar await para tarea dentro de expresión using
fr: Tâche Await dans l’expression using
it: await Task in espressione using
ja: using 式内の Task を待機する
ko: using 식의 await Task
ru: Задача await в выражении "using"
tr: using ifadesi içinde await Task
zh_hans: using 表达式中的 Await Task
zh_hant: using 運算式中的 Await Task

# VSTHRD107_CodeFix_Title
source: Await using expression
de: Await using-Ausdruck
es: Usar await en expresión using
fr: Attendre l’expression using
it: Espressione using await
ja: using 式を待機する
ko: await using 식
ru: Выражение "using" в await
tr: Await using ifadesi
zh_hans: 等待 using 表达式
zh_hant: Await using 運算式

# VSTHRD002_CodeFix_Await_Title
source: Use await instead
de: Stattdessen "await" verwenden
es: Use await en su lugar
fr: Utiliser await à la place
it: In alternativa, usare await
ja: 代わりに Await を使用する
ko: 대신 await를 사용합니다.
ru: Вместо этого используйте await.
tr: Bunun yerine await kullanın
zh_hans: 改用 await
zh_hant: 改用 await
