Repository: microsoft/vs-threading
Catalog: src/Microsoft.VisualStudio.Threading.Analyzers/Strings.*.resx
Languages: de, es, fr, it, ja, ko, pt_br, ru, tr, zh_hans, zh_hant

# AwaitXInstead
source: Await {0} instead
de: Stattdessen auf {0} warten
es: Use await {0} en su lugar
fr: Attendre {0} à la place
it: In alternativa, usare await {0}
ja: 代わりに {0} を待機する
ko: 대신 {0}을(를) 기다립니다.
pt_br: Esperam por {0} em vez disso
ru: Вместо этого используйте Await {0}.
tr: Bunun yerine: Await {0}
zh_hans: 改为 await {0}
zh_hant: 改為 await {0}

source: Use await instead
de: Stattdessen "await" verwenden
es: Use await en su lugar
fr: Utiliser await à la place
it: In alternativa, usare await
ja: 代わりに Await を使用する
ko: 대신 await를 사용합니다.
pt_br: Uso aguardam em vez disso
ru: Вместо этого используйте await.
tr: Bunun yerine await kullanın
zh_hans: 改用 await
zh_hant: 改用 await

# VSTHRD002_MessageFormat
source: Synchronously waiting on tasks or awaiters may cause deadlocks. Use await or JoinableTaskFactory.Run instead.
de: Das synchrone Warten auf Aufgaben oder Awaiters führt unter Umständen zu Deadlocks. Verwenden Sie stattdessen "await" oder "JoinableTaskFactory.Run".
es: La espera sincrónica de tareas o elementos que ejecutan await puede provocar interbloqueos. Use await o JoinableTaskFactory.Run en su lugar.
fr: L'attente de manière synchrone de tâches ou d’éléments en attente peut entraîner des blocages. Utilisez await ou JoinableTaskFactory.Run à la place.
it: L'attesa in modalità sincrona di attività o awaiter può causare deadlock. In alternativa, usare await o JoinableTaskFactory.Run.
ja: 同期的にタスクまたは awaiter を待機すると、デッドロックが引き起こされる可能性があります。代わりに await または JoinableTaskFactory.Run を使用してください。
ko: 작업을 동기적으로 대기합니다. 그러지 않으면 대기자가 교착 상태를 일으킬 수 있습니다. 대신 await나 JoinableTaskFactory.Run을 사용합니다.
pt_br: Síncrona espera nas tarefas ou awaiters é perigosa e pode causar bloqueios de morto. Por favor, considere as seguintes opções: 1) alternar para wait assíncrono se o chamador já é um método de "async". 2) alteração da cadeia de chamadores para ser "async" métodos e altere esse código para ser assíncrono aguardam. 3) Utilize JoinableTaskFactory.Run() para aguardar as tarefas ou awaiters. Consulte http://blogs.msdn.com/b/andrewarnottms/archive/2014/05/07/asynchronous-and-multithreaded-programming-within-vs-using-the-joinabletaskfactory.aspx para mais informação.
ru: Синхронное ожидание задач или объектов awaiter может приводить к взаимоблокировкам. Используйте вместо этого await или JoinableTaskFactory.Run.
tr: Görevlerde veya bekleyen öğelerde zaman uyumlu olarak beklemek kilitlenmelere neden olabilir. Bunun yerine bekleyen veya JoinableTaskFactory.Run kullanın.
zh_hans: 同步等待任务或 awaiter 可能导致死锁。请等待或改用 JoinableTaskFactory.Run。
zh_hant: 同步等候 task 或 awaiter 可能會造成死結。請改用 await 或 JoinableTaskFactory.Run。

# VSTHRD002_Title
source: Avoid problematic synchronous waits
de: Problematische synchrone Wartevorgänge vermeiden
es: Evite esperas sincrónicas problemáticas
fr: Éviter les attentes synchrones problématiques
it: Evita attese sincrone problematiche
ja: 問題のある同期待機を避ける
ko: 문제가 있는 동기 대기를 사용하지 않습니다.
pt_br: Síncrona espera nas tarefas ou awaiters é perigosa e pode causar bloqueios de morto.
ru: Избегание проблемных синхронных ожиданий
tr: Sorunlu zaman uyumlu beklemelerden kaçının
zh_hans: 避免有问题的同步等待
zh_hant: 避免有問題的同步等候

# VSTHRD010_Title
source: Invoke single-threaded types on Main thread
de: VS-Dienste aus dem UI-Thread verwenden
es: Use servicios de VS desde el subproceso de IU
fr: Utiliser les services VS à partir du thread d’interface utilisateur
it: Usa i servizi di Visual Studio dal thread dell'interfaccia utente
ja: UI スレッドから VS サービスを使用する
ko: UI 스레드의 VS 서비스를 사용합니다.
pt_br: Visual Studio de serviço deve ser usado no thread principal explicitamente.
ru: Использование служб VS в потоке пользовательского интерфейса
tr: UI iş parçacığından VS hizmetlerini kullanın
zh_hans: 使用 UI 线程中的 VS 服务
zh_hant: 從 UI 執行緒使用 VS 服務

# VSTHRD100_MessageFormat
source: Avoid "async void" methods, because any exceptions not handled by the method will crash the process
de: Vermeiden Sie "async void"-Methoden, da Ausnahmen, die nicht von der Methode verarbeitet werden, zu einem Absturz des Prozesses führen.
es: Evite métodos "async void", porque las excepciones no controladas por el método bloquearán el proceso.
fr: Évitez les méthodes "async void", car toute exception non traitée par la méthode bloque le processus.
it: Evitare metodi "async void" perché tutte le eccezioni non gestite dal metodo causeranno l'arresto anomalo del processo.
ja: "async void" メソッドは使用しないでください。このメソッドで処理されていない例外によりプロセスがクラッシュします。
ko: 메서드에서 처리하지 않은 예외로 프로세스가 중단될 수 있으므로 "async void" 메서드를 사용하지 마세요.
pt_br: Evite método Async Void, porque todas as exceções lançadas fora de um método de vazio async serão geradas diretamente sobre o SynchronizationContext e travará o processo. Consulte a https://msdn.microsoft.com/en-us/magazine/jj991977.aspx para mais informação.
ru: Избегайте методов "async void", так как любые исключения, не обработанные этим методом, вызовут сбой процесса.
tr: "async void" metotları tarafından işlenmeyen tüm özel durumlar işlemi kilitleyeceğinden bunları kullanmayın.
zh_hans: 避免使用“Async Void”方法，因为此方法未处理的任何异常都将导致进程故障。
zh_hant: 因為任何不是由 "async void" 方法處理的例外狀況都會使處理序損毀，所以請避免該方法。

# VSTHRD100_Title
source: Avoid async void methods
de: "async void"-Methoden vermeiden
es: Evite métodos async void
fr: Éviter les méthodes async void
it: Evita metodi asincroni void
ja: async void メソッドを使用しない
ko: async void 메서드를 사용하지 않습니다.
pt_br: Evite o método Async Void.
ru: Избегание методов async void
tr: Async void metotları kullanmayın
zh_hans: 避免使用 Async Void 方法
zh_hant: 避免 async void 方法

# VSTHRD101_MessageFormat
source: Avoid using async lambda for a void returning delegate type, because any exceptions not handled by the delegate will crash the process
de: Vermeiden Sie die Verwendung von Async Lambda für einen "void" zurückgebenden Delegattypen, da Ausnahmen, die nicht vom Delegaten verarbeitet werden, zu einem Absturz des Prozesses führen.
es: Evite usar la lambda async para un tipo de delegado de devolución void, porque las excepciones no controladas por el delegado bloquearán el proceso.
fr: Évitez d’utiliser une expression lambda asynchrone pour un type de délégué retournant void, car toute exception non traitée par la méthode bloque le processus.
it: Evitare di usare espressioni lambda asincrone per un tipo di delegato che restituisce void, perché tutte le eccezioni non gestite dal delegato causeranno l'arresto anomalo del processo.
ja: デリゲート型を返す void に非同期ラムダは使用しないでください。このデリゲートで処理されていない例外によりプロセスがクラッシュします。
ko: 대리자에서 처리하지 않은 예외로 프로세스가 중단될 수 있으므로 void 반환 대리자 형식에 대해 비동기 람다를 사용하지 마세요.
pt_br: Evite usar async lambda como tipo de retorno void delegado, porque todas as exceções lançadas fora uma lambda async retornar void serão geradas diretamente sobre o SynchronizationContext e travará o processo. Consulte a https://msdn.microsoft.com/en-us/magazine/jj991977.aspx para mais informação.
ru: Не используйте лямбда-выражения async в типах делегатов, которые возвращают void, так как исключения, не обработанные делегатом, вызовут сбой процесса.
tr: Temsilci tarafından işlenmeyen tüm özel durumlar işlemi kilitleyeceğinden, temsilci türü döndüren bir void için async lambda kullanmayın.
zh_hans: 避免对返回委托类型的 void 使用异步 lambda，因为此委托未处理的任何异常都将导致进程故障。
zh_hant: 因為任何不是由 void 傳回委派類型處理的例外狀況都會使處理序損毀，所以請避免對該類型使用非同步 lambda。

# VSTHRD101_Title
source: Avoid unsupported async delegates
de: Nicht unterstützte asynchrone Delegaten vermeiden
es: Evite delegados asincrónicos no compatibles
fr: Éviter les délégués async non pris en charge
it: Evita delegati asincroni non supportati
ja: サポートされていないい非同期デリゲートを使用しない
ko: 지원되지 않는 비동기 대리자를 사용하지 않습니다.
pt_br: Async lambda está sendo usado como a tipo de retorno void delegado.
ru: Избегание неподдерживаемых делегатов async
tr: Desteklenmeyen async temsilcilerini kullanmayın
zh_hans: 避免不支持的异步委托
zh_hant: 避免不支援的非同步委派

# VSTHRD106_MessageFormat
source: AsyncEventHandler delegates should be invoked via the extension method "TplExtensions.InvokeAsync()" defined in Microsoft.VisualStudio.Threading assembly
de: AsyncEventHandler-Delegaten müssen über die Erweiterungsmethode "TplExtensions.InvokeAsync()", die in der Microsoft.VisualStudio.Threading-Assembly definiert ist, aufgerufen werden.
es: Los delegados de AsyncEventHandler deben invocarse a través del método de extensión "TplExtensions.InvokeAsync()" definido en el ensamblado Microsoft.VisualStudio.Threading.
fr: Les délégués AsyncEventHandler doivent être appelés avec la méthode d’extension "TplExtensions.InvokeAsync()" définie dans l’assembly Microsoft.VisualStudio.Threading.
it: I delegati di AsyncEventHandler devono essere richiamati tramite il metodo di estensione "TplExtensions.InvokeAsync()" definito nell'assembly Microsoft.VisualStudio.Threading.
ja: AsyncEventHandler デリゲートは、Microsoft.VisualStudio.Threading アセンブリで定義されている拡張メソッド "TplExtensions.InvokeAsync()" で呼び出される必要があります。
ko: Microsoft.VisualStudio.Threading 어셈블리에 정의된 "TplExtensions.InvokeAsync()" 확장 메서드를 통해 AsyncEventHandler 대리자를 호출해야 합니다.
pt_br: Delegados de AsyncEventHandler devem ser chamados através do método de extensão "TplExtensions.InvokeAsync()" definida no assembly Microsoft.VisualStudio.Threading.
ru: Делегаты AsyncEventHandler следует вызывать при помощи метода расширения "TplExtensions.InvokeAsync()", определенного в сборке Microsoft.VisualStudio.Threading.
tr: AsyncEventHandler temsilcileri, Microsoft.VisualStudio.Threading bütünleştirilmiş kodunda tanımlanan "TplExtensions.InvokeAsync()" genişletme metodu aracılığıyla çağrılmalıdır.
zh_hans: 应通过 Microsoft.VisualStudio.Threading 程序集中定义的扩展方法“TplExtensions.InvokeAsync()”调用 AsyncEventHandler 委托。
zh_hant: AsyncEventHandler 委派應透過在 Microsoft.VisualStudio.Threading 組件中定義的延伸模組方法 "TplExtensions.InvokeAsync()" 叫用。

# VSTHRD106_Title
source: Use InvokeAsync to raise async events
de: InvokeAsync zum Auslösen asynchroner Ereignisse verwenden
es: Use InvokeAsync para desencadenar eventos asincrónicos
fr: Utiliser InvokeAsync pour déclencher des événements async
it: Usa InvokeAsync per generare eventi asincroni
ja: InvokeAsync を使用して非同期イベントを発生させる
ko: 비동기 이벤트를 발생하는 InvokeAsync 사용
pt_br: Delegados de AsyncEventHandler devem ser chamados através do método de extensão "TplExtensions.InvokeAsync()" definida no assembly Microsoft.VisualStudio.Threading.
ru: Использование InvokeAsync для вызова асинхронных событий
tr: Async olayları tetiklemek için InvokeAsync kullanın
zh_hans: 使用 InvokeAsync 引发异步事件
zh_hant: 使用 InvokeAsync 引發非同步事件

# VSTHRD003_MessageFormat
source: Avoid awaiting or returning a Task representing work that was not started within your context as that can lead to deadlocks. Start the work within this context, or use JoinableTaskFactory.RunAsync to start the task and await the returned JoinableTask instead.
de: Das Aufrufen von "await" für eine Aufgabe innerhalb von "JoinableTaskFactory.Run" führt unter Umständen zu Deadlocks, wenn die Aufgabe außerhalb des Delegaten initialisiert wird. Sie können dies vermeiden, indem Sie sicherstellen, dass die Aufgabe innerhalb des Delegaten initialisiert wird, oder "JoinableTask" anstelle der Aufgabe verwenden.
es: La llamada a await en un elemento Task dentro de JoinableTaskFactory.Run, cuando la tarea se ha iniciado fuera del delegado, puede provocar posibles interbloqueos. Puede evitar este problema asegurándose de que la tarea se ha iniciado dentro del delegado o usando JoinableTask en lugar de Task.
fr: Le fait d'appeler await sur une tâche dans une méthode JoinableTaskFactory.Run quand la tâche est initialisée en dehors du délégué peut entraîner des blocages. Vous pouvez éviter ce problème en vérifiant que la tâche est initialisée dans le délégué ou en utilisant JoinableTask à la place de Task.
it: La chiamata di await su un elemento Task all'interno di un elemento JoinableTaskFactory.Run quando Task è inizializzato all'esterno del delegato può causare possibili deadlock. Per evitare il problema, assicurarsi che Task venga inizializzato all'interno del delegato oppure usare JoinableTask invece di Task.
ja: タスクがデリゲート外部で初期化されている場合、JoinableTaskFactory.Run 内の Task で await を呼び出すと、デッドロックが引き起こされる可能性があります。 この問題は、タスクが確実にデリゲート内で初期化されるようにするか、Task の代わりに JoinableTask を使用することによって回避できます。
ko: 작업이 외부에서 초기화되면 대리자가 잠재적인 교착 상태를 일으킬 수 있으므로 JoinableTaskFactory.Run 내 Task에서 호출을 대기합니다. 작업이 대리자 내에서 초기화되도록 하거나 Task 대신 JoinableTask를 사용하여 이 문제를 방지할 수 있습니다.
pt_br: Chamando aguardam em uma tarefa dentro de um JoinableTaskFactory.Run, quando a tarefa é inicializada fora o delegado pode causar deadlocks potenciais. , Você pode evitar este problema, garantindo que a tarefa é inicializada dentro do delegado ou usando JoinableTask ao invés de tarefa.
ru: При вызове await в объекте Task в JoinableTaskFactory.Run (и при условии, что задача инициализирована за пределами делегата) могут произойти взаимоблокировки. Вы можете избежать этой проблемы, инициализировав задачу в делегате или использовав JoinableTask вместо Task.
tr: JoinableTaskFactory.Run içindeki bir Task için await çağırmak, görevin temsilci dışında başlatılması durumunda olası kilitlenmelere neden olabilir. Görevin temsilci içinde başlatılmasını sağlayarak veya Task yerine JoinableTask kullanarak bu sorunu önleyebilirsiniz.
zh_hans: 在委托外初始化任务时，对 JoinableTaskFactory.Run 内部 Task 调用 await 可能导致死锁。 通过确保在委托内部初始化任务或使用 JoinableTask 取代 Task，可以避免此问题。
zh_hant: 當工作在委派的外部初始化時，對 JoinableTaskFactory.Run 內的 Task 上呼叫 await 可能會造成潛在的死結。 您可以讓工作在委派內初始化，或不使用 Task 而改用 JoinableTask 來避免此問題。

# VSTHRD003_Title
source: Avoid awaiting foreign Tasks
de: Warten auf Tasks, für die kein Beitritt möglich ist, in Join-Kontexten vermeiden
es: Evite usar await para tareas que no sean de unión en contextos de unión
fr: Éviter d’attendre des tâches non joignables dans des contextes de jointure
it: Evita l'uso di await Task non joinable in contesti di join
ja: 結合コンテキストで結合できないタスクを待機しない
ko: 조인 컨텍스트에서 조인할 수 없는 작업을 대기하지 않습니다.
pt_br: Evitar chamando aguardam a tarefa dentro de "JoinableTaskFactory.Run" delegado quando a tarefa é definida fora o delegado para evitar deadlocks potenciais.
ru: Избегание await в неприсоединяемых задачах в контекстах соединения
tr: Birleşik olmayan görevleri birleşik ortamlarda beklemeyin
zh_hans: 避免等待联接上下文中的非可加入任务
zh_hant: 避免在加入內容中等候不可加入的工作

# VSTHRD011_MessageFormat
source: Lazy<Task<T>>.Value can deadlock. Use AsyncLazy<T> instead.
de: "Lazy<Task<T>>.Value" führt unter Umständen zu einem Deadlock. Verwenden Sie stattdessen "AsyncLazy<T>".
es: Lazy<Task<T>>.Value puede provocar interbloqueos. Use AsyncLazy<T> en su lugar.
fr: Lazy<Task<T>>.Value peut entraîner un blocage. Utilisez AsyncLazy<T> à la place
it: Lazy<Task<T>>.Value può causare deadlock. In alternativa, usare AsyncLazy<T>.
ja: Lazy<Task<T>>.Value はデッドロックを引き起こす可能性があります。 代わりに AsyncLazy<T> を使用してください。
ko: Lazy<Task<T>>.Value가 교착 상태가 될 수 있습니다. 대신 AsyncLazy<T>를 사용하세요.
pt_br: Chamando o preguiçoso<Task<T>>. Valor pode bloqueio quando a fábrica de valor anteriormente foi iniciada. , Você deve usar o AsyncLazy<T> em vez disso.
ru: Lazy<Task<T>>.Value может вызвать взаимоблокировку. Вместо этого используйте AsyncLazy<T>.
tr: Lazy<Task<T>>.Value kilitlenebilir. Bunun yerine AsyncLazy<T> kullanın.
zh_hans: Lazy<Task<T>>.Value 可能死锁。 改用 AsyncLazy<T>。
zh_hant: Lazy<Task<T>>.Value 可能會造成死結。 請改用 AsyncLazy<T>。

# VSTHRD011_Title
source: Use AsyncLazy<T>
de: Die Verwendung von Lazy<T> vermeiden, wenn T ein Task<T2> ist
es: Evite el uso de Lazy<T> donde T es Task<T2>
fr: Éviter d’utiliser Lazy<T> si T est une tâche<T2>
it: Evitare di usare Lazy<T> in cui T è un elemento Task<T2>
ja: T が Task<T2> を表す Lazy<T> を使用しない
ko: <T>T가 Task인 경우 Lazy를 사용하지 않습니다.<T2>
pt_br: Evite usar Lazy <T> , onde T é uma tarefa.
ru: Не используйте Lazy<T>, где T — объект Task<T2>
tr: T’nin Task<T> olduğu durumlarda Lazy<T2> kullanmayın.
zh_hans: 当 T 为 Task<T2> 时，避免使用 Lazy<T>
zh_hant: 避免在 T 為 Task<T2> 時使用 Lazy<T>

# VSTHRD103_MessageFormat
source: {0} synchronously blocks. Await {1} instead.
de: {0} synchron blockiert. Warten Sie stattdessen auf {1}.
es: {0} bloquea sincrónicamente. Use await {1} en su lugar.
fr: {0} bloque de façon synchrone. Attendez {1} à la place.
it: {0} si blocca in modalità sincrona. In alternativa, usare await {1}.
ja: {0} は同期的にブロックを実行します。代わりに {1} を待機してください。
ko: {0}이(가) 동기적으로 차단합니다. 대신 {1}을(를) 기다립니다.
pt_br: O membro {0} sincronicamente bloqueia. Chamar {1} em vez disso e aguarde o seu resultado.
ru: {0} синхронно блокирует. Вместо этого используйте Await {1}.
tr: {0} zaman uyumlu olarak engeller. Bunun yerine {1} bekleyin.
zh_hans: {0} 同步阻止。改为 await {1}。
zh_hant: {0} 會同步封鎖。請改用 await {1}。

# VSTHRD103_MessageFormat_UseAwaitInstead
source: {0} synchronously blocks. Use await instead.
de: {0} synchron blockiert. Verwenden Sie stattdessen "await".
es: {0} bloquea sincrónicamente. Use await en su lugar.
fr: {0} bloque de façon synchrone. Utilisez await à la place
it: {0} si blocca in modalità sincrona. In alternativa, usare await.
ja: {0} は同期的にブロックを実行します。代わりに await を使用してください。
ko: {0}이(가) 동기적으로 차단합니다. 대신 await를 사용합니다.
pt_br: O membro {0} sincronicamente bloqueia. Uso aguardam em vez disso.
ru: {0} синхронно блокирует. Вместо этого используйте await.
tr: {0} zaman uyumlu olarak engeller. Bunun yerine await kullanın.
zh_hans: {0} 同步阻止。改用 await。
zh_hant: {0} 會同步封鎖。請改用 await。

# VSTHRD103_Title
source: Call async methods when in an async method
de: Asynchrone Methoden in einer asynchronen Methode aufrufen
es: Llame a métodos asincrónicos cuando esté en un método asincrónico
fr: Appeler des méthodes async dans une méthode async
it: Chiama metodi asincroni se il metodo è asincrono
ja: 非同期メソッドの場合に非同期メソッドを呼び出す
ko: 비동기 메서드인 경우 비동기 메서드를 호출합니다.
pt_br: Chame awaitable alternativas quando em um método assíncrono.
ru: Вызов асинхронных методов в методе async
tr: Zaman uyumsuz metottayken zaman uyumsuz metotlar çağırın
zh_hans: 当在异步方法中时，调用异步方法
zh_hant: 在使用非同步方法時呼叫非同步方法

# VSTHRD102_MessageFormat
source: Limit use of synchronously blocking method calls such as JoinableTaskFactory.Run or Task.Result to public entrypoint members where you must be synchronous. Using it for internal members can needlessly add synchronous frames between asynchronous frames, leading to threadpool exhaustion.
de: Beschränken Sie die Verwendung synchron blockierender Methodenaufrufe wie "JoinableTaskFactory.Run" oder "Task.Result" auf öffentliche Einstiegspunktmitglieder, bei denen Sie synchron sein müssen. Wenn Sie sie für interne Mitglieder verwenden, werden asynchronen Frames unter Umständen unnötigerweise synchrone Frames hinzugefügt, was zu einer Auslastung des Threadpools führt.
es: Limite el uso de llamadas de métodos de bloqueo sincrónico, como JoinableTaskFactory.Run o Task.Result, a miembros de punto de entrada públicos donde tiene que ser sincrónico. El uso para miembros internos puede agregar innecesariamente marcos sincrónicos entre marcos asincrónicos, provocando el agotamiento del conjunto de subprocesos.
fr: Limitez l'utilisation des appels de méthode de blocage synchrones, comme JoinableTaskFactory.Run ou Task.Result, aux membres de point d’entrée publics où il est nécessaire d’être synchrone. Son utilisation pour des membres internes peut inutilement ajouter des frames synchrones entre les frames asynchrones, provoquant l'épuisement du pool de threads.
it: Limita l'uso di chiamate a metodi con blocco asincrono, come JoinableTaskFactory.Run o Task.Result, a membri di punti di ingresso pubblici in cui è necessario essere sincroni. Se vengono usate per membri interni, è possibile che vengano aggiunti frame sincroni non necessari tra frame asincroni e questo può causare l'esaurimento del pool di thread.
ja: JoinableTaskFactory.Run または Task.Result など、同期的にブロックを行うメソッド呼び出しの使用は、同期が必要な公開エントリポイント メンバーに限定してください。内部メンバーに対して使用すると、非同期フレーム間に同期フレームが不必要に追加され、スレッドプールが消費されます。
ko: 동기화되어야 하는 공개 진입점 멤버에 JoinableTaskFactory.Run 또는 Task.Resut처럼 동기적으로 차단하는 메서드 호출 사용을 제한합니다. 내부 멤버에 이러한 매서드 호출을 사용하면 비동기 프레임 사이에 동기 프레임을 불필요하게 추가하여 threadpool이 소모될 수 있습니다.
pt_br: Limite de uso de forma síncrona, bloquear chamadas de método como JoinableTaskFactory.Run ou Task.Result para público entrypoint Membros onde você deve ser síncrono. Usá-lo para membros internos desnecessariamente pode adicionar quadros síncronos entre quadros assíncronos, conduzindo ao esgotamento do pool de threads.
ru: Разрешите использовать вызовы методов синхронной блокировки, такие как JoinableTaskFactory.Run или Task.Result, только элементам общедоступных точек входа, где требуется синхронизация. Если их будут использовать внутренние элементы, между асинхронными фреймами могут быть добавлены лишние синхронные фреймы, что приведет к нехватке ресурсов в пуле потока.
tr: Zaman uyumlu olmanız gereken genel giriş noktası üyelerinde, JoinableTaskFactory.Run veya Task.Result gibi zaman uyumlu olarak engelleyen metot çağrılarının kullanımını sınırlayın. Bunu iç üyeler için kullanmak, zaman uyumsuz çerçevelerin arasına gereksiz yere zaman uyumlu çerçeveler ekleyerek iş parçacığı havuzunun tükenmesine sebep olabilir.
zh_hans: 当必须为同步时，仅限公共入口点成员使用同步阻止方法调用，如 JoinableTaskFactory.Run 或 Task.Result。将其用于内部成员会在异步框架间添加多余同步框架，进而导致线程池枯竭。
zh_hant: 在必須同步時，請限制對公開輸入點成員使用 JoinableTaskFactory.Run 或 Task.Result 這類同步封鎖方法呼叫。對內部成員使用這種方法，可能會在非同步框架之間新增不必要的同步框架，而消耗執行緒集區。

# VSTHRD102_Title
source: Implement internal logic asynchronously
de: Interne Logik asynchron implementieren
es: Implemente la lógica interna asincrónicamente
fr: Implémenter la logique interne de façon asynchrone
it: Implementa la logica interna in modalità asincrona
ja: 内部論理を非同期的に実装する
ko: 내부 논리를 비동기적으로 구현
pt_br: Evite blocos síncronos em métodos não-públicos.
ru: Реализация внутренней логики асинхронно
tr: İç mantığı zaman uyumsuz olarak uygulayın
zh_hans: 异步实现内部逻辑
zh_hant: 以非同步方式實作內部邏輯

# VSTHRD200_CodeFix_Title
source: Rename to {0}
de: In {0} umbenennen
es: Cambie el nombre a {0}
fr: Renommer en {0}
it: Rinomina in {0}
ja: {0} に名前を変更する
ko: {0}(으)로 이름 바꾸기
pt_br: Renomear para {0}.
ru: Переименование в {0}
tr: {0} olarak yeniden adlandırın
zh_hans: 重命名为 {0}
zh_hant: 重新命名為 {0}

# VSTHRD200_Title
source: Use "Async" suffix for async methods
de: Verwenden Sie das Suffix "Async" für asynchrone Methoden
es: Use el sufijo "Async" para métodos asincrónicos
fr: Utiliser le suffixe "Async" pour les méthodes asynchrones
it: Usa suffisso "Async" per metodi asincroni
ja: 非同期メソッドに "Async" サフィックスを使用する
ko: 비동기 메서드에 "Async" 접미사 사용
pt_br: Use o sufixo "Async" em nomes de método de retorno de tarefa.
ru: Использование суффикса "Async" в асинхронных методах
tr: Async metotları için "Async" sonekini kullanın
zh_hans: 对异步方法使用“Async”后缀
zh_hant: 對非同步方法使用 "Async" 尾碼
